

/*
    Модуль проведення документу
*/

using AccountingSoftware;
using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class ЗакриттяЗамовленняПостачальнику_SpendTheDocument
{
    private static async Task<SelectRequest_Record> ОтриматиЗамовленняПостачальнику(ЗакриттяЗамовленняПостачальнику_Objest ДокументОбєкт,
        ЗакриттяЗамовленняПостачальнику_Товари_TablePart.Record ТовариРядок)
    {
        string query = $@"
SELECT
    ЗамовленняПостачальникам.{ЗамовленняПостачальникам_Const.Номенклатура} AS Номенклатура,
    ЗамовленняПостачальникам.{ЗамовленняПостачальникам_Const.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
    ЗамовленняПостачальникам.{ЗамовленняПостачальникам_Const.Склад} AS Склад,
    ЗамовленняПостачальникам.{ЗамовленняПостачальникам_Const.Замовлено} AS Замовлено
FROM
    {ЗамовленняПостачальникам_Const.TABLE} AS ЗамовленняПостачальникам
WHERE
    ЗамовленняПостачальникам.{ЗамовленняПостачальникам_Const.ЗамовленняПостачальнику} = @ЗамовленняПостачальнику AND
    ЗамовленняПостачальникам.{ЗамовленняПостачальникам_Const.Номенклатура} = @Номенклатура AND
    ЗамовленняПостачальникам.{ЗамовленняПостачальникам_Const.ХарактеристикаНоменклатури} = @ХарактеристикаНоменклатури AND
    ЗамовленняПостачальникам.{ЗамовленняПостачальникам_Const.Склад} = @Склад
";
        return await Config.Kernel.DataBase.SelectRequest(query, new()
        {
            { "ЗамовленняПостачальнику", ДокументОбєкт.ЗамовленняПостачальнику.UniqueID.UGuid },
            { "Номенклатура", ТовариРядок.Номенклатура.UniqueID.UGuid },
            { "ХарактеристикаНоменклатури", ТовариРядок.ХарактеристикаНоменклатури.UniqueID.UGuid },
            { "Склад", !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад.UniqueID.UGuid : ДокументОбєкт.Склад.UniqueID.UGuid }
        });
    }

    public static async Task<bool> Spend(ЗакриттяЗамовленняПостачальнику_Objest ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Objest> СписокНоменклатури = [];
            List<string> СписокІнформаційнихПовідомлень = [];

            if (ДокументОбєкт.ЗамовленняПостачальнику.IsEmpty())
                throw new Exception($"Не заповнене Замовлення постачальнику");
            else
                await ДокументОбєкт.ЗамовленняПостачальнику.GetPresentation();

            foreach (ЗакриттяЗамовленняПостачальнику_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);
            }

            #endregion

            #region ЗамовленняПостачальникам

            ЗамовленняПостачальникам_RecordsSet замовленняКлієнтів_RecordsSet = new();

            await ДокументОбєкт.Товари_TablePart.Read();

            foreach (ЗакриттяЗамовленняПостачальнику_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    var recordResult = await ОтриматиЗамовленняПостачальнику(ДокументОбєкт, ТовариРядок);
                    if (recordResult.Result)
                    {
                        Dictionary<string, object> row = recordResult.ListRow[0];

                        ЗамовленняПостачальникам_RecordsSet.Record record = new()
                        {
                            Income = false,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            ЗамовленняПостачальнику = ДокументОбєкт.ЗамовленняПостачальнику,
                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                            Замовлено = (decimal)row["Замовлено"]
                        };

                        замовленняКлієнтів_RecordsSet.Records.Add(record);
                    }
                    else
                        СписокІнформаційнихПовідомлень.Add(
                            $"Рядок №{ТовариРядок.НомерРядка}.\n" +
                            $"Для товару <b>{СписокНоменклатури[ТовариРядок.НомерРядка].Назва}</b> відсутній залишок в регістрі ЗамовленняПостачальникам по документу <b>{ДокументОбєкт.ЗамовленняПостачальнику.Назва}</b>.\n" +
                            "Пропущено рух по регістру для даного товару!\n"
                        );
                }
            }

            await замовленняКлієнтів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static Task ClearSpend(ЗакриттяЗамовленняПостачальнику_Objest ДокументОбєкт)
    {
        return Task.CompletedTask;
    }
}
