

/*
    Модуль проведення документу
*/

using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class ПереміщенняТоварівНаСкладі_SpendTheDocument
{
    public static async Task<bool> Spend(ПереміщенняТоварівНаСкладі_Objest ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Objest> СписокНоменклатури = [];
            Dictionary<int, decimal> ЗалишокНоменклатури = [];

            foreach (ПереміщенняТоварівНаСкладі_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);

                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    //Одиниця виміру береться з номенклатури
                    ПакуванняОдиниціВиміру_Pointer ОдиницяВиміруНоменклатури = СписокНоменклатури[ТовариРядок.НомерРядка].ОдиницяВиміру;

                    //
                    //Для товарів отримуємо залишки
                    //

                    var recordResult = await ПроведенняДокументів.ОтриматиЗалишкиТоваруВКомірці(
                        ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури, ОдиницяВиміруНоменклатури,
                        ТовариРядок.КоміркаВідправник, ТовариРядок.Серія,
                        ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                    ЗалишокНоменклатури.Add(ТовариРядок.НомерРядка, recordResult.Result ? (decimal)recordResult.ListRow[0]["ВНаявності"] : 0);

                    if (ЗалишокНоменклатури[ТовариРядок.НомерРядка] > 0)
                    {
                        if (ЗалишокНоменклатури[ТовариРядок.НомерРядка] < ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок)
                        {
                            throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                $"Залишок товару {ЗалишокНоменклатури[ТовариРядок.НомерРядка]}, потрібно {ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок}\n" +
                                $"Номенклатура {СписокНоменклатури[ТовариРядок.НомерРядка].Назва}\n" +
                                $"Характеристика {await ТовариРядок.ХарактеристикаНоменклатури.GetPresentation()}\n" +
                                $"Пакування {await ОдиницяВиміруНоменклатури.GetPresentation()}\n" +
                                $"Комірка {await ТовариРядок.КоміркаВідправник.GetPresentation()}\n" +
                                $"Серія {await ТовариРядок.Серія.GetPresentation()}\n");
                        }
                    }
                    else
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Відсутній товар {СписокНоменклатури[ТовариРядок.НомерРядка].Назва}");
                    }
                }
            }

            #endregion

            #region ТовариВКомірках

            ТовариВКомірках_RecordsSet товариВКомірках_RecordsSet = new();

            foreach (ПереміщенняТоварівНаСкладі_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    //Одиниця виміру береться з номенклатури
                    ПакуванняОдиниціВиміру_Pointer ОдиницяВиміруНоменклатури = СписокНоменклатури[ТовариРядок.НомерРядка].ОдиницяВиміру;

                    //КоміркаВідправник
                    {
                        ТовариВКомірках_RecordsSet.Record record = new()
                        {
                            Income = false,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Пакування = ОдиницяВиміруНоменклатури,
                            Комірка = ТовариРядок.КоміркаВідправник,
                            Серія = ТовариРядок.Серія,
                            ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок,
                        };

                        товариВКомірках_RecordsSet.Records.Add(record);
                    }

                    //КоміркаОтримувач
                    {
                        ТовариВКомірках_RecordsSet.Record record = new()
                        {
                            Income = true,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Пакування = ОдиницяВиміруНоменклатури,
                            Комірка = ТовариРядок.КоміркаОтримувач,
                            Серія = ТовариРядок.Серія,
                            ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок,
                        };

                        товариВКомірках_RecordsSet.Records.Add(record);
                    }
                }
            }

            await товариВКомірках_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static Task ClearSpend(ПереміщенняТоварівНаСкладі_Objest ДокументОбєкт)
    {
        return Task.CompletedTask;
    }
}