

/*
    Модуль проведення документу
*/

using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class ЗамовленняКлієнта_SpendTheDocument
{
    public static async Task<bool> Spend(ЗамовленняКлієнта_Object ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Object> СписокНоменклатури = [];
            Dictionary<int, decimal> ВільнийЗалишокНоменклатури = [];

            foreach (ЗамовленняКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);

                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    //
                    //Резерви та вільні залишки
                    //

                    var recordResult = await ПроведенняДокументів.ОтриматиРезервТоваруНаСкладі(
                         ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                         !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                         ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                    if (recordResult.Result)
                    {
                        var Резерв = recordResult.ListRow;

                        decimal ВНаявності = (decimal)Резерв[0]["ВНаявності"];
                        decimal ВРезервіЗіСкладу = (decimal)Резерв[0]["ВРезервіЗіСкладу"];

                        ВільнийЗалишокНоменклатури.Add(ТовариРядок.НомерРядка, ВНаявності - ВРезервіЗіСкладу);
                    }
                    else
                        ВільнийЗалишокНоменклатури.Add(ТовариРядок.НомерРядка, 0);
                }
            }

            #endregion

            #region ЗамовленняКлієнтів

            ЗамовленняКлієнтів_RecordsSet замовленняКлієнтів_RecordsSet = new();

            await ДокументОбєкт.Товари_TablePart.Read();

            foreach (ЗамовленняКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ЗамовленняКлієнтів_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        ЗамовленняКлієнта = ДокументОбєкт.GetDocumentPointer(),
                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                        Замовлено = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок,
                        Сума = ТовариРядок.Сума
                    };

                    замовленняКлієнтів_RecordsSet.Records.Add(record);
                }
            }

            await замовленняКлієнтів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region ВільніЗалишки

            ВільніЗалишки_RecordsSet вільніЗалишки_RecordsSet = new();

            foreach (ЗамовленняКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ВільніЗалишки_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                        ВРезервіЗіСкладу = ВільнийЗалишокНоменклатури[ТовариРядок.НомерРядка],
                        ДокументРезерву = ДокументОбєкт.UniqueID.UGuid
                    };

                    decimal КількістьЯкуПотрібноРозприділити = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок;

                    if (ВільнийЗалишокНоменклатури[ТовариРядок.НомерРядка] > 0)
                        if (КількістьЯкуПотрібноРозприділити <= ВільнийЗалишокНоменклатури[ТовариРядок.НомерРядка])
                        {
                            record.ВРезервіЗіСкладу = КількістьЯкуПотрібноРозприділити;
                            КількістьЯкуПотрібноРозприділити = 0;
                        }
                        else
                        {
                            record.ВРезервіЗіСкладу = ВільнийЗалишокНоменклатури[ТовариРядок.НомерРядка];
                            КількістьЯкуПотрібноРозприділити = КількістьЯкуПотрібноРозприділити - ВільнийЗалишокНоменклатури[ТовариРядок.НомерРядка];
                        }

                    if (КількістьЯкуПотрібноРозприділити > 0)
                        record.ВРезервіПідЗамовлення = КількістьЯкуПотрібноРозприділити;

                    вільніЗалишки_RecordsSet.Records.Add(record);
                }
            }

            await вільніЗалишки_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static Task ClearSpend(ЗамовленняКлієнта_Object ДокументОбєкт)
    {
        return Task.CompletedTask;
    }
}