

/*
    Модуль проведення документу
*/

using AccountingSoftware;
using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class ЗакриттяЗамовленняКлієнта_SpendTheDocument
{
    private static async Task<SelectRequest_Record> ОтриматиЗамовленняКлієнта(ЗакриттяЗамовленняКлієнта_Objest ДокументОбєкт,
        ЗакриттяЗамовленняКлієнта_Товари_TablePart.Record ТовариРядок)
    {
        string query = $@"
SELECT
    ЗамовленняКлієнтів.{ЗамовленняКлієнтів_Const.Номенклатура} AS Номенклатура,
    ЗамовленняКлієнтів.{ЗамовленняКлієнтів_Const.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
    ЗамовленняКлієнтів.{ЗамовленняКлієнтів_Const.Склад} AS Склад,
    ЗамовленняКлієнтів.{ЗамовленняКлієнтів_Const.Замовлено} AS Замовлено,
    ЗамовленняКлієнтів.{ЗамовленняКлієнтів_Const.Сума} AS Сума
FROM
    {ЗамовленняКлієнтів_Const.TABLE} AS ЗамовленняКлієнтів
WHERE
    ЗамовленняКлієнтів.{ЗамовленняКлієнтів_Const.ЗамовленняКлієнта} = @ЗамовленняКлієнта AND
    ЗамовленняКлієнтів.{ЗамовленняКлієнтів_Const.Номенклатура} = @Номенклатура AND
    ЗамовленняКлієнтів.{ЗамовленняКлієнтів_Const.ХарактеристикаНоменклатури} = @ХарактеристикаНоменклатури AND
    ЗамовленняКлієнтів.{ЗамовленняКлієнтів_Const.Склад} = @Склад
";
        return await Config.Kernel.DataBase.SelectRequest(query, new()
        {
            { "ЗамовленняКлієнта", ДокументОбєкт.ЗамовленняКлієнта.UniqueID.UGuid },
            { "Номенклатура", ТовариРядок.Номенклатура.UniqueID.UGuid },
            { "ХарактеристикаНоменклатури", ТовариРядок.ХарактеристикаНоменклатури.UniqueID.UGuid },
            { "Склад", !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад.UniqueID.UGuid : ДокументОбєкт.Склад.UniqueID.UGuid }
        });
    }

    private static async Task<SelectRequest_Record> ОтриматиВільніЗалишки(ЗакриттяЗамовленняКлієнта_Objest ДокументОбєкт,
        ЗакриттяЗамовленняКлієнта_Товари_TablePart.Record ТовариРядок)
    {
        string query = $@"
SELECT
    ВільніЗалишки.{ВільніЗалишки_Const.Номенклатура} AS Номенклатура,
    ВільніЗалишки.{ВільніЗалишки_Const.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
    ВільніЗалишки.{ВільніЗалишки_Const.Склад} AS Склад,
    ВільніЗалишки.{ВільніЗалишки_Const.ВРезервіЗіСкладу} AS ВРезервіЗіСкладу,
    ВільніЗалишки.{ВільніЗалишки_Const.ВРезервіПідЗамовлення} AS ВРезервіПідЗамовлення
FROM
    {ВільніЗалишки_Const.TABLE} AS ВільніЗалишки
WHERE
    ВільніЗалишки.{ВільніЗалишки_Const.ДокументРезерву} = @ДокументРезерву AND
    ВільніЗалишки.{ВільніЗалишки_Const.Номенклатура} = @Номенклатура AND
    ВільніЗалишки.{ВільніЗалишки_Const.ХарактеристикаНоменклатури} = @ХарактеристикаНоменклатури AND
    ВільніЗалишки.{ВільніЗалишки_Const.Склад} = @Склад
";
        return await Config.Kernel.DataBase.SelectRequest(query, new()
        {
            { "ДокументРезерву", ДокументОбєкт.ЗамовленняКлієнта.UniqueID.UGuid },
            { "Номенклатура", ТовариРядок.Номенклатура.UniqueID.UGuid },
            { "ХарактеристикаНоменклатури", ТовариРядок.ХарактеристикаНоменклатури.UniqueID.UGuid },
            { "Склад", !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад.UniqueID.UGuid : ДокументОбєкт.Склад.UniqueID.UGuid }
        });
    }

    public static async Task<bool> Spend(ЗакриттяЗамовленняКлієнта_Objest ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Objest> СписокНоменклатури = [];
            List<string> СписокІнформаційнихПовідомлень = [];

            if (ДокументОбєкт.ЗамовленняКлієнта.IsEmpty())
                throw new Exception($"Не заповнене Замовлення клієнта");
            else
                await ДокументОбєкт.ЗамовленняКлієнта.GetPresentation();

            foreach (ЗакриттяЗамовленняКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);
            }

            #endregion

            #region ЗамовленняКлієнтів

            ЗамовленняКлієнтів_RecordsSet замовленняКлієнтів_RecordsSet = new();

            await ДокументОбєкт.Товари_TablePart.Read();

            foreach (ЗакриттяЗамовленняКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    var recordResult = await ОтриматиЗамовленняКлієнта(ДокументОбєкт, ТовариРядок);
                    if (recordResult.Result)
                    {
                        Dictionary<string, object> row = recordResult.ListRow[0];

                        ЗамовленняКлієнтів_RecordsSet.Record record = new()
                        {
                            Income = false,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            ЗамовленняКлієнта = ДокументОбєкт.ЗамовленняКлієнта,
                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                            Замовлено = (decimal)row["Замовлено"],
                            Сума = (decimal)row["Сума"]
                        };

                        замовленняКлієнтів_RecordsSet.Records.Add(record);
                    }
                    else
                        СписокІнформаційнихПовідомлень.Add(
                            $"Рядок №{ТовариРядок.НомерРядка}.\n" +
                            $"Для товару <b>{СписокНоменклатури[ТовариРядок.НомерРядка].Назва}</b> відсутній залишок в регістрі ЗамовленняКлієнтів по документу <b>{ДокументОбєкт.ЗамовленняКлієнта.Назва}</b>.\n" +
                            "Пропущено рух по регістру для даного товару!\n"
                        );
                }
            }

            await замовленняКлієнтів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region ВільніЗалишки

            ВільніЗалишки_RecordsSet вільніЗалишки_RecordsSet = new();

            foreach (ЗакриттяЗамовленняКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    var recordResult = await ОтриматиВільніЗалишки(ДокументОбєкт, ТовариРядок);
                    if (recordResult.Result)
                    {
                        Dictionary<string, object> row = recordResult.ListRow[0];

                        ВільніЗалишки_RecordsSet.Record record = new()
                        {
                            Income = false,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                            ВРезервіЗіСкладу = (decimal)row["ВРезервіЗіСкладу"],
                            ВРезервіПідЗамовлення = (decimal)row["ВРезервіПідЗамовлення"],
                            ДокументРезерву = ДокументОбєкт.ЗамовленняКлієнта.UniqueID.UGuid
                        };

                        вільніЗалишки_RecordsSet.Records.Add(record);
                    }
                    else
                        СписокІнформаційнихПовідомлень.Add(
                            $"Рядок №{ТовариРядок.НомерРядка}.\n" +
                            $"Для товару <b>{СписокНоменклатури[ТовариРядок.НомерРядка].Назва}</b> відсутній залишок в регістрі ВільніЗалишки по документу <b>{ДокументОбєкт.ЗамовленняКлієнта.Назва}</b>.\n" +
                            "Пропущено рух по регістру для даного товару!\n"
                        );
                }
            }

            await вільніЗалишки_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            //Вивід інформаційних повідомлень
            if (СписокІнформаційнихПовідомлень.Count > 0)
                ПроведенняДокументів.ДодатиІнформаційнеПовідомлення(ДокументОбєкт, ДокументОбєкт.Назва, string.Join("\n", СписокІнформаційнихПовідомлень));

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static Task ClearSpend(ЗакриттяЗамовленняКлієнта_Objest ДокументОбєкт)
    {
        return Task.CompletedTask;
    }
}