

/*
    Модуль проведення документу
*/

using StorageAndTrade;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class РозхіднийКасовийОрдер_SpendTheDocument
{
    public static async Task<bool> Spend(РозхіднийКасовийОрдер_Object ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            #endregion

            #region РозрахункиЗКлієнтами

            РозрахункиЗКлієнтами_RecordsSet розрахункиЗКлієнтами_RecordsSet = new();

            if (ДокументОбєкт.ГосподарськаОперація == Перелічення.ГосподарськіОперації.ПоверненняОплатиКлієнту)
            {
                РозрахункиЗКлієнтами_RecordsSet.Record record_Клієнт = new()
                {
                    Income = false,

                    Контрагент = ДокументОбєкт.Контрагент,
                    Валюта = ДокументОбєкт.Валюта,
                    Сума = ДокументОбєкт.СумаДокументу
                };

                розрахункиЗКлієнтами_RecordsSet.Records.Add(record_Клієнт);
            }

            await розрахункиЗКлієнтами_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РозрахункиЗПостачальниками

            РозрахункиЗПостачальниками_RecordsSet розрахункиЗПостачальниками_RecordsSet = new();

            if (ДокументОбєкт.ГосподарськаОперація == Перелічення.ГосподарськіОперації.ОплатаПостачальнику)
            {
                РозрахункиЗПостачальниками_RecordsSet.Record record_Постачальник = new()
                {
                    Income = true,

                    Контрагент = ДокументОбєкт.Контрагент,
                    Валюта = ДокументОбєкт.Валюта,
                    Сума = ДокументОбєкт.СумаДокументу
                };

                розрахункиЗПостачальниками_RecordsSet.Records.Add(record_Постачальник);
            }

            await розрахункиЗПостачальниками_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РухКоштів

            РухКоштів_RecordsSet рухКоштів_RecordsSet = new();

            //Поступлення коштів в КасаОтримувач
            if (ДокументОбєкт.ГосподарськаОперація == Перелічення.ГосподарськіОперації.ВидачаКоштівВІншуКасу)
            {
                РухКоштів_RecordsSet.Record record_ІншаКаса = new()
                {
                    Income = true,

                    Організація = ДокументОбєкт.Організація,
                    Каса = ДокументОбєкт.КасаОтримувач,
                    Валюта = ДокументОбєкт.Валюта,
                    Сума = ДокументОбєкт.СумаДокументу
                };

                рухКоштів_RecordsSet.Records.Add(record_ІншаКаса);
            }

            //Поступлення коштів на банківський рахунок
            if (ДокументОбєкт.ГосподарськаОперація == Перелічення.ГосподарськіОперації.ЗдачаКоштівВБанк)
            {
                // ...
            }

            //Списання коштів з каси
            РухКоштів_RecordsSet.Record record_РухКоштів = new РухКоштів_RecordsSet.Record()
            {
                Income = false,

                Організація = ДокументОбєкт.Організація,
                Каса = ДокументОбєкт.Каса,
                Валюта = ДокументОбєкт.Валюта,
                Сума = ДокументОбєкт.СумаДокументу
            };

            рухКоштів_RecordsSet.Records.Add(record_РухКоштів);
            await рухКоштів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Бух

            if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            {
                var БухОперація = await ДокументОбєкт.ДокументБухгалтерськаОперація.GetDocumentObject(true);
                if (БухОперація != null)
                {
                    if (!await БухОперація.SpendTheDocument(БухОперація.ДатаДок))
                        throw new Exception($"Не вдалось провести бухгалтерський документ {БухОперація.Назва}");
                }
                else
                    throw new Exception($"Не вдалось прочитати бухгалтерський документ {ДокументОбєкт.ДокументБухгалтерськаОперація}");
            }

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static async Task Clear(РозхіднийКасовийОрдер_Object ДокументОбєкт)
    {
        if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            await ДокументОбєкт.ДокументБухгалтерськаОперація.ClearSpendTheDocument();
    }
}
