
/*
    ПоверненняТоварівПостачальнику_Triggers.cs
    Тригери для документу ПоверненняТоварівПостачальнику
*/

using GeneratedCode.Константи;
using StorageAndTrade;

namespace GeneratedCode.Документи;

class ПоверненняТоварівПостачальнику_Triggers
{
    public static async Task New(ПоверненняТоварівПостачальнику_Object ДокументОбєкт)
    {
        int number = await НумераціяДокументів.ПоверненняТоварівПостачальнику();
        ДокументОбєкт.НомерДок = (await НумераціяДокументів.ПоверненняТоварівПостачальнику(++number)).ToString("D8");

        ДокументОбєкт.ДатаДок = DateTime.Now;
        ДокументОбєкт.Автор = Program.Користувач;
        ДокументОбєкт.Менеджер = Program.Користувач;
    }

    public static Task Copying(ПоверненняТоварівПостачальнику_Object ДокументОбєкт, ПоверненняТоварівПостачальнику_Object Основа)
    {
        ДокументОбєкт.Назва += " - Копія";
        ДокументОбєкт.ДокументБухгалтерськаОперація = new();
        return Task.CompletedTask;
    }

    public static async Task BeforeSave(ПоверненняТоварівПостачальнику_Object ДокументОбєкт)
    {
        ДокументОбєкт.Назва = $"{ПоверненняТоварівПостачальнику_Const.FULLNAME} №{ДокументОбєкт.НомерДок} від {ДокументОбєкт.ДатаДок.ToString("dd.MM.yyyy")}";

        if (ДокументОбєкт.ВідобразитиВБухгалтерськомуОбліку)
            ДокументОбєкт.ДокументБухгалтерськаОперація =
                await ФункціїДляДокументів.СтворитиДокументБухгалтерськаОперація(ДокументОбєкт.ДокументБухгалтерськаОперація, new()
                {
                    ДатаДок = ДокументОбєкт.ДатаДок,
                    Організація = ДокументОбєкт.Організація,
                    Основа = ДокументОбєкт.GetBasis()
                });
        else if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
        {
            await ДокументОбєкт.ДокументБухгалтерськаОперація.SetDeletionLabel(true);
            ДокументОбєкт.ДокументБухгалтерськаОперація = new();
        }
    }

    public static Task AfterSave(ПоверненняТоварівПостачальнику_Object ДокументОбєкт)
    {
        return Task.CompletedTask;
    }

    public static Task SetDeletionLabel(ПоверненняТоварівПостачальнику_Object ДокументОбєкт, bool label)
    {
        return Task.CompletedTask;
    }

    public static Task BeforeDelete(ПоверненняТоварівПостачальнику_Object ДокументОбєкт)
    {
        return Task.CompletedTask;
    }
}
