

/*
    Модуль проведення документу
*/

using AccountingSoftware;
using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class ПоверненняТоварівПостачальнику_SpendTheDocument
{
    private static async Task<SelectRequest_Record> ОтриматиПартіїТоваруЗДокументуПоступлення(ПоверненняТоварівПостачальнику_Objest ДокументОбєкт,
        ПоверненняТоварівПостачальнику_Товари_TablePart.Record ТовариРядок)
    {
        string query = $@"
SELECT 
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.ПартіяТоварівКомпозит} AS ПартіяТоварівКомпозит,
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Рядок} AS Рядок,
    Довідник_ПартіяТоварівКомпозит.{ПартіяТоварівКомпозит_Const.Дата} AS ПартіяТоварівКомпозит_Дата,
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Кількість} AS Кількість,
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Собівартість} AS Собівартість
FROM 
    {ПартіїТоварів_Const.TABLE} AS Рег_ПартіїТоварів
        
    LEFT JOIN {ПартіяТоварівКомпозит_Const.TABLE} AS Довідник_ПартіяТоварівКомпозит ON Довідник_ПартіяТоварівКомпозит.uid = 
        Рег_ПартіїТоварів.{ПартіїТоварів_Const.ПартіяТоварівКомпозит}

WHERE
    Рег_ПартіїТоварів.Owner = @ДокументПоступлення AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Організація} = @Організація AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Номенклатура} = @Товар AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.ХарактеристикаНоменклатури} = @Характеристика AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Серія} = @Серія AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Склад} = @Склад

ORDER BY ПартіяТоварівКомпозит_Дата ASC
";
        return await Config.Kernel.DataBase.SelectRequest(query, new()
        {
            { "ДокументПоступлення", ТовариРядок.ДокументПоступлення.UniqueID.UGuid },
            { "Організація", ДокументОбєкт.Організація.UniqueID.UGuid },
            { "Товар", ТовариРядок.Номенклатура.UniqueID.UGuid },
            { "Характеристика", ТовариРядок.ХарактеристикаНоменклатури.UniqueID.UGuid },
            { "Серія", ТовариРядок.Серія.UniqueID.UGuid },
            { "Склад", ДокументОбєкт.Склад.UniqueID.UGuid }
        });
    }

    public static async Task<bool> Spend(ПоверненняТоварівПостачальнику_Objest ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Objest> СписокНоменклатури = [];

            foreach (ПоверненняТоварівПостачальнику_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);
            }

            #endregion

            #region Товари на складах

            ТовариНаСкладах_RecordsSet товариНаСкладах_RecordsSet = new();

            foreach (ПоверненняТоварівПостачальнику_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ТовариНаСкладах_RecordsSet.Record record = new()
                    {
                        Income = false,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Серія = ТовариРядок.Серія,
                        Склад = ДокументОбєкт.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок
                    };

                    товариНаСкладах_RecordsSet.Records.Add(record);
                }
            }

            await товариНаСкладах_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Партії товарів

            ПартіїТоварів_RecordsSet партіїТоварів_RecordsSet = new();

            foreach (ПоверненняТоварівПостачальнику_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    var recordResult = await ОтриматиПартіїТоваруЗДокументуПоступлення(ДокументОбєкт, ТовариРядок);

                    if (!recordResult.Result)
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Немає доступних партій для товару {СписокНоменклатури[ТовариРядок.НомерРядка].Назва}");
                    }

                    decimal КількістьЯкуПотрібноПовернути = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок;

                    Dictionary<string, object> nameRow = recordResult.ListRow[0];

                    decimal КількістьВПартії = (decimal)nameRow["Кількість"];
                    decimal СобівартістьПартії = (decimal)nameRow["Собівартість"];
                    ПартіяТоварівКомпозит_Pointer ПартіяТоварівКомпозит = new(nameRow["ПартіяТоварівКомпозит"]);
                    int Рядок = (int)nameRow["Рядок"];

                    if (КількістьЯкуПотрібноПовернути <= КількістьВПартії)
                    {
                        ПартіїТоварів_RecordsSet.Record record = new()
                        {
                            Income = false,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            Організація = ДокументОбєкт.Організація,
                            ПартіяТоварівКомпозит = ПартіяТоварівКомпозит,
                            Кількість = КількістьЯкуПотрібноПовернути,
                            Собівартість = КількістьЯкуПотрібноПовернути == КількістьВПартії ? СобівартістьПартії : 0,
                            СписанаСобівартість = СобівартістьПартії,
                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Серія = ТовариРядок.Серія,
                            Склад = ДокументОбєкт.Склад,
                            Рядок = Рядок
                        };

                        партіїТоварів_RecordsSet.Records.Add(record);
                    }
                    else
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Кількість в партії менша чим кількість яку повертають для товару {СписокНоменклатури[ТовариРядок.НомерРядка].Назва}");
                    }
                }
            }

            await партіїТоварів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region ВільніЗалишки

            ВільніЗалишки_RecordsSet вільніЗалишки_RecordsSet = new();

            foreach (ПоверненняТоварівПостачальнику_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ВільніЗалишки_RecordsSet.Record record = new()
                    {
                        Income = false,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = ДокументОбєкт.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок
                    };

                    вільніЗалишки_RecordsSet.Records.Add(record);
                }
            }

            await вільніЗалишки_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РозрахункиЗПостачальниками

            РозрахункиЗПостачальниками_RecordsSet розрахункиЗПостачальниками_RecordsSet = new();
            РозрахункиЗПостачальниками_RecordsSet.Record розрахункиЗПостачальниками_Record = new()
            {
                Income = false,

                Контрагент = ДокументОбєкт.Контрагент,
                Валюта = ДокументОбєкт.Валюта,
                Сума = ДокументОбєкт.СумаДокументу
            };

            розрахункиЗПостачальниками_RecordsSet.Records.Add(розрахункиЗПостачальниками_Record);
            await розрахункиЗПостачальниками_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Закупівлі

            Закупівлі_RecordsSet закупівлі_RecordsSet = new();

            foreach (ПоверненняТоварівПостачальнику_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                Закупівлі_RecordsSet.Record record = new()
                {
                    OwnerLineNum = ТовариРядок.НомерРядка,

                    Організація = ДокументОбєкт.Організація,
                    Склад = ДокументОбєкт.Склад,
                    Контрагент = ДокументОбєкт.Контрагент,
                    Договір = ДокументОбєкт.Договір,
                    Номенклатура = ТовариРядок.Номенклатура,
                    ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                    Кількість = -(ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок),
                    Сума = -ТовариРядок.Сума,
                    Собівартість = Math.Round(ТовариРядок.Ціна / ТовариРядок.КількістьУпаковок, 2)
                };

                закупівлі_RecordsSet.Records.Add(record);
            }

            await закупівлі_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static Task ClearSpend(ПоверненняТоварівПостачальнику_Objest ДокументОбєкт)
    {
        return Task.CompletedTask;
    }
}
