

/*
    Модуль проведення документу
*/

using AccountingSoftware;
using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class ПоверненняТоварівВідКлієнта_SpendTheDocument
{
    private static async Task<SelectRequest_Record> ОтриматиПартіїТоваруЗДокументуРеалізації(ПоверненняТоварівВідКлієнта_Object ДокументОбєкт,
        ПоверненняТоварівВідКлієнта_Товари_TablePart.Record ТовариРядок)
    {
        string query = $@"
SELECT 
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.ПартіяТоварівКомпозит} AS ПартіяТоварівКомпозит,
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Рядок} AS Рядок,
    Довідник_ПартіяТоварівКомпозит.{ПартіяТоварівКомпозит_Const.Дата} AS ПартіяТоварівКомпозит_Дата,
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Кількість} AS Кількість,
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Собівартість} AS Собівартість,
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.СписанаСобівартість} AS СписанаСобівартість
FROM 
    {ПартіїТоварів_Const.TABLE} AS Рег_ПартіїТоварів
        
    LEFT JOIN {ПартіяТоварівКомпозит_Const.TABLE} AS Довідник_ПартіяТоварівКомпозит ON Довідник_ПартіяТоварівКомпозит.uid = 
        Рег_ПартіїТоварів.{ПартіїТоварів_Const.ПартіяТоварівКомпозит}

WHERE
    Рег_ПартіїТоварів.Owner = @ДокументРеалізації AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Організація} = @Організація AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Номенклатура} = @Товар AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.ХарактеристикаНоменклатури} = @Характеристика AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Серія} = @Серія AND
    Рег_ПартіїТоварів.{ПартіїТоварів_Const.Склад} = @Склад

ORDER BY ПартіяТоварівКомпозит_Дата ASC
";
        return await Config.Kernel.DataBase.SelectRequest(query, new()
        {
            { "ДокументРеалізації", ТовариРядок.ДокументРеалізації.UniqueID.UGuid },
            { "Організація", ДокументОбєкт.Організація.UniqueID.UGuid },
            { "Товар", ТовариРядок.Номенклатура.UniqueID.UGuid },
            { "Характеристика", ТовариРядок.ХарактеристикаНоменклатури.UniqueID.UGuid },
            { "Серія", ТовариРядок.Серія.UniqueID.UGuid },
            { "Склад", ДокументОбєкт.Склад.UniqueID.UGuid }
        });
    }

    public static async Task<bool> Spend(ПоверненняТоварівВідКлієнта_Object ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Object> СписокНоменклатури = [];

            foreach (ПоверненняТоварівВідКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);
            }

            #endregion

            #region ВільніЗалишки

            ВільніЗалишки_RecordsSet вільніЗалишки_RecordsSet = new();

            foreach (ПоверненняТоварівВідКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ВільніЗалишки_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = ДокументОбєкт.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок
                    };

                    вільніЗалишки_RecordsSet.Records.Add(record);
                }
            }

            await вільніЗалишки_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Товари на складах

            ТовариНаСкладах_RecordsSet товариНаСкладах_RecordsSet = new();

            foreach (ПоверненняТоварівВідКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ТовариНаСкладах_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Серія = ТовариРядок.Серія,
                        Склад = ДокументОбєкт.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок
                    };

                    товариНаСкладах_RecordsSet.Records.Add(record);
                }
            }

            await товариНаСкладах_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Партії товарів  & Продажі

            ПартіїТоварів_RecordsSet партіїТоварів_RecordsSet = new();
            Продажі_RecordsSet продажі_RecordsSet = new();

            foreach (ПоверненняТоварівВідКлієнта_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    var recordResult = await ОтриматиПартіїТоваруЗДокументуРеалізації(ДокументОбєкт, ТовариРядок);
                    if (!recordResult.Result)
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Немає доступних партій для товару {СписокНоменклатури[ТовариРядок.НомерРядка].Назва}");
                    }

                    decimal КількістьЯкуПотрібноПовернути = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок;

                    foreach (Dictionary<string, object> nameRow in recordResult.ListRow)
                    {
                        decimal КількістьВПартії = (decimal)nameRow["Кількість"];
                        decimal СобівартістьПартії = (decimal)nameRow["Собівартість"];
                        decimal СписанаСобівартістьПартії = (decimal)nameRow["СписанаСобівартість"];
                        ПартіяТоварівКомпозит_Pointer ПартіяТоварівКомпозит = new(nameRow["ПартіяТоварівКомпозит"]);
                        int Рядок = (int)nameRow["Рядок"];

                        decimal КількістьЩоПовертається = 0;

                        if (КількістьВПартії <= КількістьЯкуПотрібноПовернути)
                        {
                            КількістьЩоПовертається = КількістьВПартії;
                            КількістьЯкуПотрібноПовернути -= КількістьВПартії;
                        }
                        else
                        {
                            КількістьЩоПовертається = КількістьЯкуПотрібноПовернути;
                            КількістьЯкуПотрібноПовернути = 0;
                        }

                        //ПартіїТоварів
                        {
                            ПартіїТоварів_RecordsSet.Record record = new()
                            {
                                Income = true,
                                OwnerLineNum = ТовариРядок.НомерРядка,

                                Організація = ДокументОбєкт.Організація,
                                ПартіяТоварівКомпозит = ПартіяТоварівКомпозит,
                                Кількість = КількістьЩоПовертається,
                                Собівартість = СобівартістьПартії,
                                СписанаСобівартість = СписанаСобівартістьПартії,
                                Номенклатура = ТовариРядок.Номенклатура,
                                ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                                Серія = ТовариРядок.Серія,
                                Склад = ДокументОбєкт.Склад,
                                Рядок = Рядок
                            };

                            партіїТоварів_RecordsSet.Records.Add(record);
                        }

                        //Продажі
                        {
                            decimal ЦінаЗаОдиницюОблікуНоменклатури = ТовариРядок.Ціна / ТовариРядок.КількістьУпаковок;

                            Продажі_RecordsSet.Record record = new()
                            {
                                OwnerLineNum = ТовариРядок.НомерРядка,

                                Організація = ДокументОбєкт.Організація,
                                Склад = ДокументОбєкт.Склад,
                                Контрагент = ДокументОбєкт.Контрагент,
                                Договір = ДокументОбєкт.Договір,
                                Номенклатура = ТовариРядок.Номенклатура,
                                ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                                Кількість = -КількістьЩоПовертається,
                                Сума = -(ЦінаЗаОдиницюОблікуНоменклатури * КількістьЩоПовертається),
                                Дохід = -(ЦінаЗаОдиницюОблікуНоменклатури * КількістьЩоПовертається - СобівартістьПартії * КількістьЩоПовертається),
                                Собівартість = СобівартістьПартії
                            };

                            продажі_RecordsSet.Records.Add(record);
                        }

                        if (КількістьЯкуПотрібноПовернути == 0)
                            break;
                    }

                    if (КількістьЯкуПотрібноПовернути > 0)
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Невистачило повернути {КількістьЯкуПотрібноПовернути} товарів");
                    }
                }
            }

            await партіїТоварів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());
            await продажі_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РозрахункиЗКлієнтами

            РозрахункиЗКлієнтами_RecordsSet розрахункиЗКлієнтами_RecordsSet = new();
            РозрахункиЗКлієнтами_RecordsSet.Record розрахункиЗКлієнтами_Record = new()
            {
                Income = false,

                Контрагент = ДокументОбєкт.Контрагент,
                Валюта = ДокументОбєкт.Валюта,
                Сума = ДокументОбєкт.СумаДокументу
            };

            розрахункиЗКлієнтами_RecordsSet.Records.Add(розрахункиЗКлієнтами_Record);
            await розрахункиЗКлієнтами_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Бух

            if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            {
                var БухОперація = await ДокументОбєкт.ДокументБухгалтерськаОперація.GetDocumentObject(true);
                if (БухОперація != null)
                {
                    if (!await БухОперація.SpendTheDocument(БухОперація.ДатаДок))
                        throw new Exception($"Не вдалось провести бухгалтерський документ {БухОперація.Назва}");
                }
                else
                    throw new Exception($"Не вдалось прочитати бухгалтерський документ {ДокументОбєкт.ДокументБухгалтерськаОперація}");
            }

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static async Task Clear(ПоверненняТоварівВідКлієнта_Object ДокументОбєкт)
    {
        if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            await ДокументОбєкт.ДокументБухгалтерськаОперація.ClearSpendTheDocument();
    }
}