

/*
    Модуль проведення документу
*/

using StorageAndTrade;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class ПрихіднийКасовийОрдер_SpendTheDocument
{
    public static async Task<bool> Spend(ПрихіднийКасовийОрдер_Objest ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            #endregion

            #region РозрахункиЗКлієнтами

            РозрахункиЗКлієнтами_RecordsSet розрахункиЗКлієнтами_RecordsSet = new();

            if (ДокументОбєкт.ГосподарськаОперація == Перелічення.ГосподарськіОперації.ПоступленняОплатиВідКлієнта)
            {
                РозрахункиЗКлієнтами_RecordsSet.Record record_Клієнт = new()
                {
                    Income = false,

                    Контрагент = ДокументОбєкт.Контрагент,
                    Валюта = ДокументОбєкт.Валюта,
                    Сума = ДокументОбєкт.СумаДокументу
                };

                розрахункиЗКлієнтами_RecordsSet.Records.Add(record_Клієнт);
            }

            await розрахункиЗКлієнтами_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РозрахункиЗПостачальниками

            РозрахункиЗПостачальниками_RecordsSet розрахункиЗПостачальниками_RecordsSet = new();

            if (ДокументОбєкт.ГосподарськаОперація == Перелічення.ГосподарськіОперації.ПоверненняКоштівПостачальнику)
            {
                РозрахункиЗПостачальниками_RecordsSet.Record record_Постачальник = new()
                {
                    Income = false,

                    Контрагент = ДокументОбєкт.Контрагент,
                    Валюта = ДокументОбєкт.Валюта,
                    Сума = ДокументОбєкт.СумаДокументу
                };

                розрахункиЗПостачальниками_RecordsSet.Records.Add(record_Постачальник);
            }

            await розрахункиЗПостачальниками_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РухКоштів

            РухКоштів_RecordsSet рухКоштів_RecordsSet = new();

            //Списання коштів з КасаВідправник
            if (ДокументОбєкт.ГосподарськаОперація == Перелічення.ГосподарськіОперації.ПоступленняКоштівЗІншоїКаси)
            {
                РухКоштів_RecordsSet.Record record_ІншаКаса = new()
                {
                    Income = false,

                    Організація = ДокументОбєкт.Організація,
                    Каса = ДокументОбєкт.КасаВідправник,
                    Валюта = ДокументОбєкт.Валюта,
                    Сума = ДокументОбєкт.СумаДокументу
                };

                рухКоштів_RecordsSet.Records.Add(record_ІншаКаса);
            }

            //Списання коштів з банківського рахунку
            if (ДокументОбєкт.ГосподарськаОперація == Перелічення.ГосподарськіОперації.ПоступленняКоштівЗБанку)
            {
                // ...
            }

            //Поступлення коштів в касу
            РухКоштів_RecordsSet.Record record_РухКоштів = new()
            {
                Income = true,

                Організація = ДокументОбєкт.Організація,
                Каса = ДокументОбєкт.Каса,
                Валюта = ДокументОбєкт.Валюта,
                Сума = ДокументОбєкт.СумаДокументу
            };

            рухКоштів_RecordsSet.Records.Add(record_РухКоштів);
            await рухКоштів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static Task ClearSpend(ПрихіднийКасовийОрдер_Objest ДокументОбєкт)
    {
        return Task.CompletedTask;
    }
}