/*

Спільні функції для бух 

*/


using GeneratedCode.Довідники;

namespace StorageAndTrade;

/// <summary>
/// Спільні функції для бух 
/// </summary>
static class ФункціїДляБух
{
    /// <summary>
    /// Функція пошуку рахунку в категорії
    /// </summary>
    /// <param name="НазваРеквізитуРахунку">Назва реквізиту рахунку в категорії</param>
    /// <param name="Категорія">Вказівник на категорію</param>
    /// <returns>Рахунок вказівник</returns>
    public static async Task<(ПланРахунків_Pointer, Статті_Pointer)> РахунокЗКатегорії(
        string НазваРеквізитуРахунку, string НазваРеквізитуСтатті, Категорії_Pointer Категорія)
    {
        Категорії_Select Вибірка = new();
        bool result = await Вибірка.SelectByField([НазваРеквізитуРахунку, НазваРеквізитуСтатті], "uid", Категорія.UniqueID.UGuid);

        ПланРахунків_Pointer Рахунок = new();
        Статті_Pointer Стаття = new();

        if (result)
        {
            Рахунок = НазваРеквізитуРахунку switch
            {
                "РахунокВитрат" => Вибірка.РахунокВитрат,
                "РахунокДоходів" => Вибірка.РахунокДоходів,
                "РахунокОбліку" => Вибірка.РахунокОбліку,
                _ => new()
            };

            Стаття = НазваРеквізитуСтатті switch
            {
                "СтаттяВитрат" => Вибірка.СтаттяВитрат,
                "СтаттяДоходів" => Вибірка.СтаттяДоходів,
                _ => new()
            };
        }

        return (Рахунок, Стаття);
    }

    /// <summary>
    /// Пошук рахунку витрат в Номенклатурі або Складі або стандартний рахунок за кодом
    /// </summary>
    /// param name="НазваРеквізитуРахунку">Назва реквізиту рахунку в категорії</param>
    /// <param name="Номенклатура">Вказівник на номенклатуру</param>
    /// <param name="Склад">Вказівник на склад</param>
    /// <param name="СтандартнийКодРахунку">Стандартний рахунок</param>
    /// <returns>Рахунок витрат вказівник</returns>
    public static async Task<(ПланРахунків_Pointer, Статті_Pointer)> РахунокЗНоменклатуриАбоСкладу(
        string НазваРеквізитуРахунку, string НазваРеквізитуСтатті,
        Номенклатура_Pointer Номенклатура, Склади_Pointer Склад, string СтандартнийКодРахунку = "")
    {
        ПланРахунків_Pointer Рахунок = new();
        Статті_Pointer Стаття = new();

        //Пошук в Номенклатура
        {
            Номенклатура_Select Вибірка = new();
            if (await Вибірка.SelectByField(["Категорія"], "uid", Номенклатура.UniqueID.UGuid))
                (Рахунок, Стаття) = await РахунокЗКатегорії(НазваРеквізитуРахунку, НазваРеквізитуСтатті, Вибірка.Категорія);
        }

        //Пошук в Склади якщо не знайдено в Номенклатура
        if (Рахунок.IsEmpty() && !Склад.IsEmpty())
        {
            Склади_Select Вибірка = new();
            if (await Вибірка.SelectByField(["Категорія"], "uid", Склад.UniqueID.UGuid))
                (Рахунок, Стаття) = await РахунокЗКатегорії(НазваРеквізитуРахунку, НазваРеквізитуСтатті, Вибірка.Категорія);
        }

        //Якщо не знайдено ніде, тоді стандарний рахунок
        if (Рахунок.IsEmpty())
            Рахунок = await ЗнайтиРахунокПоКоду(СтандартнийКодРахунку);

        await Рахунок.GetPresentation();
        await Стаття.GetPresentation();

        return (Рахунок, Стаття);
    }

    /// <summary>
    /// Пошук рахунку витрат в Підрозділ або стандартний рахунок за кодом
    /// </summary>
    /// param name="НазваРеквізитуРахунку">Назва реквізиту рахунку в категорії</param>
    /// <param name="Підрозділ">Вказівник на підрозділ</param>
    /// <param name="СтандартнийКодРахунку">Стандартний рахунок</param>
    /// <returns>Рахунок витрат вказівник</returns>
    public static async Task<(ПланРахунків_Pointer, Статті_Pointer)> РахунокЗПідрозділу(
        string НазваРеквізитуРахунку, string НазваРеквізитуСтатті,
        СтруктураПідприємства_Pointer Підрозділ, string СтандартнийКодРахунку = "")
    {
        ПланРахунків_Pointer Рахунок = new();
        Статті_Pointer Стаття = new();

        //Пошук в Підрозділ
        {
            СтруктураПідприємства_Select Вибірка = new();
            if (await Вибірка.SelectByField(["Категорія"], "uid", Підрозділ.UniqueID.UGuid))
                (Рахунок, Стаття) = await РахунокЗКатегорії(НазваРеквізитуРахунку, НазваРеквізитуСтатті, Вибірка.Категорія);
        }

        //Якщо не знайдено ніде, тоді стандарний рахунок
        if (Рахунок.IsEmpty())
            Рахунок = await ЗнайтиРахунокПоКоду(СтандартнийКодРахунку);

        await Рахунок.GetPresentation();
        await Стаття.GetPresentation();

        return (Рахунок, Стаття);
    }

    public static async Task<ПланРахунків_Pointer> ЗнайтиРахунокПоКоду(string Код) =>
        !string.IsNullOrEmpty(Код) ? await new ПланРахунків_Select().FindByField("Код", Код) : new();

}
