

/*
    Модуль проведення документу
*/

using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class РахунокФактура_SpendTheDocument
{
    public static async Task<bool> Spend(РахунокФактура_Objest ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Objest> СписокНоменклатури = [];

            foreach (РахунокФактура_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);

                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    //
                    //Резерви та вільні залишки
                    //

                    var recordResult = await ПроведенняДокументів.ОтриматиРезервТоваруНаСкладі(
                         ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                         !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                         ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                    if (recordResult.Result)
                    {
                        var Резерв = recordResult.ListRow;

                        decimal ВНаявності = (decimal)Резерв[0]["ВНаявності"];
                        decimal ВРезервіЗіСкладу = (decimal)Резерв[0]["ВРезервіЗіСкладу"];

                        if (ВНаявності - ВРезервіЗіСкладу < ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок)
                        {
                            throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                $"В наявності {ВНаявності}, " +
                                $"в резерві {ВРезервіЗіСкладу}, " +
                                $"вільний залишок {ВНаявності - ВРезервіЗіСкладу}, " +
                                $"потрібно зарезервувати {ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок}");
                        }
                    }
                    else
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                             $"Відсутній товар на залишку");
                    }
                }
            }
            #endregion

            #region ВільніЗалишки

            ВільніЗалишки_RecordsSet вільніЗалишки_RecordsSet = new();

            foreach (РахунокФактура_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ВільніЗалишки_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                        ВРезервіЗіСкладу = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок,
                        ДокументРезерву = ДокументОбєкт.UniqueID.UGuid
                    };

                    вільніЗалишки_RecordsSet.Records.Add(record);
                }
            }

            await вільніЗалишки_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static Task ClearSpend(РахунокФактура_Objest ДокументОбєкт)
    {
        return Task.CompletedTask;
    }
}