

/*
    Модуль проведення документу
*/

using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class ПоступленняТоварівТаПослуг_SpendTheDocument
{
    public static async Task<bool> Spend(ПоступленняТоварівТаПослуг_Object ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Object> СписокНоменклатури = [];
            Dictionary<int, decimal> ЗамовленняПостачальнику = [];

            foreach (ПоступленняТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);

                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    if (!ТовариРядок.ЗамовленняПостачальнику.IsEmpty())
                    {
                        //
                        // Якщо заданий документ Замовлення Постачальнику
                        // Перевірити замовлення
                        //

                        var recordResult = await ПроведенняДокументів.ОтриматиЗамовленняПостачальникуДляТоваруПоДокументу(
                            ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                            !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                            ТовариРядок.ЗамовленняПостачальнику.UniqueID, ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                        if (recordResult.Result)
                        {
                            ЗамовленняПостачальнику.Add(ТовариРядок.НомерРядка, (decimal)recordResult.ListRow[0]["Замовлено"]);

                            if (!(ЗамовленняПостачальнику[ТовариРядок.НомерРядка] > 0))
                            {
                                throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                    $"Залишок по документу Замовлення {ЗамовленняПостачальнику[ТовариРядок.НомерРядка]}");
                            }
                        }
                        else
                        {
                            throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                $"Відсутнє замовлення для товару {СписокНоменклатури[ТовариРядок.НомерРядка].Назва} в документі Замовлення постачальнику");
                        }
                    }
                }
            }

            #endregion

            #region Замовлення постачальникам

            ЗамовленняПостачальникам_RecordsSet замовленняПостачальникам_RecordsSet = new();

            foreach (ПоступленняТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    if (!ТовариРядок.ЗамовленняПостачальнику.IsEmpty())
                    {
                        decimal Замовлено = ЗамовленняПостачальнику.ContainsKey(ТовариРядок.НомерРядка) ? ЗамовленняПостачальнику[ТовариРядок.НомерРядка] : 0;
                        decimal Кількість = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок;

                        ЗамовленняПостачальникам_RecordsSet.Record record = new()
                        {
                            Income = false,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            ЗамовленняПостачальнику = ТовариРядок.ЗамовленняПостачальнику,
                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                            Замовлено = Замовлено > Кількість ? Кількість : Замовлено
                        };

                        замовленняПостачальникам_RecordsSet.Records.Add(record);
                    }
                }
            }

            await замовленняПостачальникам_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Товари на складах

            ТовариНаСкладах_RecordsSet товариНаСкладах_RecordsSet = new();

            foreach (ПоступленняТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ТовариНаСкладах_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                        Серія = ТовариРядок.Серія,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок
                    };

                    товариНаСкладах_RecordsSet.Records.Add(record);
                }
            }

            await товариНаСкладах_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Партії товарів

            ПартіяТоварівКомпозит_Pointer ПартіяТоварівКомпозит = await ФункціїДляДокументів.ОтриматиПартіюТоварівКомпозит(
                 ДокументОбєкт.UniqueID.UGuid,
                 Перелічення.ТипДокументуПартіяТоварівКомпозит.ПоступленняТоварівТаПослуг,
                 ДокументОбєкт, null
            );

            ПартіїТоварів_RecordsSet партіїТоварів_RecordsSet = new();

            foreach (ПоступленняТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ПартіїТоварів_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Організація = ДокументОбєкт.Організація,
                        ПартіяТоварівКомпозит = ПартіяТоварівКомпозит,
                        Кількість = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок,
                        Собівартість = Math.Round(ТовариРядок.Ціна / ТовариРядок.КількістьУпаковок, 2),
                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Серія = ТовариРядок.Серія,
                        Склад = ДокументОбєкт.Склад,
                        Рядок = ТовариРядок.НомерРядка
                    };

                    партіїТоварів_RecordsSet.Records.Add(record);
                }
            }

            await партіїТоварів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region ВільніЗалишки

            ВільніЗалишки_RecordsSet вільніЗалишки_RecordsSet = new();

            foreach (ПоступленняТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ВільніЗалишки_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок
                    };

                    вільніЗалишки_RecordsSet.Records.Add(record);
                }
            }

            await вільніЗалишки_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РозрахункиЗПостачальниками

            РозрахункиЗПостачальниками_RecordsSet розрахункиЗПостачальниками_RecordsSet = new();

            if (ДокументОбєкт.ГосподарськаОперація == Перелічення.ГосподарськіОперації.ЗакупівляВПостачальника)
            {
                РозрахункиЗПостачальниками_RecordsSet.Record recordContragent = new()
                {
                    Income = false,

                    Контрагент = ДокументОбєкт.Контрагент,
                    Валюта = ДокументОбєкт.Валюта,
                    Сума = ДокументОбєкт.СумаДокументу
                };

                розрахункиЗПостачальниками_RecordsSet.Records.Add(recordContragent);
            }

            await розрахункиЗПостачальниками_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Закупівлі

            Закупівлі_RecordsSet закупівлі_RecordsSet = new();

            foreach (ПоступленняТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                Закупівлі_RecordsSet.Record record = new()
                {
                    OwnerLineNum = ТовариРядок.НомерРядка,

                    Організація = ДокументОбєкт.Організація,
                    Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                    Контрагент = ДокументОбєкт.Контрагент,
                    Договір = ДокументОбєкт.Договір,
                    Номенклатура = ТовариРядок.Номенклатура,
                    ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                    Кількість = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок,
                    Сума = ТовариРядок.Сума,
                    Собівартість = Math.Round(ТовариРядок.Ціна / ТовариРядок.КількістьУпаковок, 2)
                };

                закупівлі_RecordsSet.Records.Add(record);
            }

            await закупівлі_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Бух

            if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            {
                var БухОперація = await ДокументОбєкт.ДокументБухгалтерськаОперація.GetDocumentObject(true);
                if (БухОперація != null)
                {
                    if (!await БухОперація.SpendTheDocument(БухОперація.ДатаДок))
                        throw new Exception($"Не вдалось провести бухгалтерський документ {БухОперація.Назва}");
                }
                else
                    throw new Exception($"Не вдалось прочитати бухгалтерський документ {ДокументОбєкт.ДокументБухгалтерськаОперація}");
            }

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static async Task Clear(ПоступленняТоварівТаПослуг_Object ДокументОбєкт)
    {
        if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            await ДокументОбєкт.ДокументБухгалтерськаОперація.ClearSpendTheDocument();
    }
}