

/*
        ВиготовленняПродукції_SpendTheDocument.cs
        Модуль проведення документу
*/

using StorageAndTrade;

using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

static class ВиготовленняПродукції_SpendTheDocument
{
    public static async Task<bool> Spend(ВиготовленняПродукції_Object ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Object> СписокНоменклатуриКомплектуючі = [];
            Dictionary<int, Номенклатура_Object> СписокНоменклатуриГотовийВиріб = [];
            Dictionary<int, decimal> ЗалишокНоменклатури = [];
            Dictionary<int, decimal> РезервНоменклатури = [];

            //Комплектуючі
            foreach (ВиготовленняПродукції_Комплектуючі_TablePart.Record ТовариРядок in ДокументОбєкт.Комплектуючі_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатуриКомплектуючі.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);

                if (СписокНоменклатуриКомплектуючі[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    //
                    //Для товарів отримуємо залишки
                    //

                    var recordResult = await ПроведенняДокументів.ОтриматиЗалишкиТоваруНаСкладі(
                        ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури, ТовариРядок.Серія,
                        ТовариРядок.Склад, ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                    ЗалишокНоменклатури.Add(ТовариРядок.НомерРядка, recordResult.Result ? (decimal)recordResult.ListRow[0]["ВНаявності"] : 0);

                    if (ЗалишокНоменклатури[ТовариРядок.НомерРядка] > 0)
                    {
                        if (ЗалишокНоменклатури[ТовариРядок.НомерРядка] < ТовариРядок.Кількість)
                        {
                            throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                $"Залишок товару {ЗалишокНоменклатури[ТовариРядок.НомерРядка]}, потрібно {ТовариРядок.Кількість}");
                        }

                        //
                        // Рахуємо всі резерви
                        //

                        recordResult = await ПроведенняДокументів.ОтриматиРезервТоваруНаСкладі(
                            ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                            ТовариРядок.Склад, ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                        РезервНоменклатури.Add(ТовариРядок.НомерРядка, recordResult.Result ? (decimal)recordResult.ListRow[0]["ВРезервіЗіСкладу"] : 0);

                        if (РезервНоменклатури[ТовариРядок.НомерРядка] > 0)
                        {
                            if (ЗалишокНоменклатури[ТовариРядок.НомерРядка] - РезервНоменклатури[ТовариРядок.НомерРядка] < ТовариРядок.Кількість)
                            {
                                throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                    $"Залишок товару {ЗалишокНоменклатури[ТовариРядок.НомерРядка]}, " +
                                    $"в резерві {РезервНоменклатури[ТовариРядок.НомерРядка]}, " +
                                    $"потрібно {ТовариРядок.Кількість}");
                            }
                        }
                    }
                    else
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Відсутній товар {СписокНоменклатуриКомплектуючі[ТовариРядок.НомерРядка].Назва}");
                    }
                }
            }

            //ГотовийВиріб
            foreach (ВиготовленняПродукції_ГотовийВиріб_TablePart.Record ТовариРядок in ДокументОбєкт.ГотовийВиріб_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатуриГотовийВиріб.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);
            }

            #endregion

            #region ТовариНаСкладах

            ТовариНаСкладах_RecordsSet товариНаСкладах_RecordsSet = new();

            //Комплектуючі
            foreach (ВиготовленняПродукції_Комплектуючі_TablePart.Record ТовариРядок in ДокументОбєкт.Комплектуючі_TablePart.Records)
            {
                if (СписокНоменклатуриКомплектуючі[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ТовариНаСкладах_RecordsSet.Record record = new()
                    {
                        Income = false,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Серія = ТовариРядок.Серія,
                        Склад = ТовариРядок.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.Коєфіціент,
                    };

                    товариНаСкладах_RecordsSet.Records.Add(record);
                }
            }

            //ГотовийВиріб
            foreach (ВиготовленняПродукції_ГотовийВиріб_TablePart.Record ТовариРядок in ДокументОбєкт.ГотовийВиріб_TablePart.Records)
            {
                if (СписокНоменклатуриГотовийВиріб[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ТовариНаСкладах_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Серія = ТовариРядок.Серія,
                        Склад = ТовариРядок.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.Коєфіціент,
                    };

                    товариНаСкладах_RecordsSet.Records.Add(record);
                }
            }

            await товариНаСкладах_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region ВільніЗалишки

            ВільніЗалишки_RecordsSet вільніЗалишки_RecordsSet = new();

            //Комплектуючі
            foreach (ВиготовленняПродукції_Комплектуючі_TablePart.Record ТовариРядок in ДокументОбєкт.Комплектуючі_TablePart.Records)
            {
                if (СписокНоменклатуриКомплектуючі[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ВільніЗалишки_RecordsSet.Record record = new()
                    {
                        Income = false,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = ТовариРядок.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.Коєфіціент,
                    };

                    вільніЗалишки_RecordsSet.Records.Add(record);
                }
            }

            //ГотовийВиріб
            foreach (ВиготовленняПродукції_ГотовийВиріб_TablePart.Record ТовариРядок in ДокументОбєкт.ГотовийВиріб_TablePart.Records)
            {
                if (СписокНоменклатуриГотовийВиріб[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ВільніЗалишки_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = ТовариРядок.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.Коєфіціент,
                    };

                    вільніЗалишки_RecordsSet.Records.Add(record);
                }
            }

            await вільніЗалишки_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Партії товарів

            decimal ЗагальнаСумаСобівартість = 0;

            ПартіїТоварів_RecordsSet партіїТоварів_RecordsSet = new();

            //Комплектуючі
            foreach (ВиготовленняПродукції_Комплектуючі_TablePart.Record ТовариРядок in ДокументОбєкт.Комплектуючі_TablePart.Records)
            {
                if (СписокНоменклатуриКомплектуючі[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    var recordResult = await ПроведенняДокументів.ОтриматиСписокНаявнихПартій(
                        ДокументОбєкт.Організація, ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                        ТовариРядок.Серія, ТовариРядок.Склад, ТовариРядок.Партія, ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок,
                        ТовариРядок.Кількість * ТовариРядок.Коєфіціент);

                    if (!recordResult.Result)
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Немає доступних партій для товару {СписокНоменклатуриКомплектуючі[ТовариРядок.НомерРядка].Назва}");
                    }

                    decimal КількістьЯкуПотрібноСписати = ТовариРядок.Кількість * ТовариРядок.Коєфіціент;

                    foreach (Dictionary<string, object> nameRow in recordResult.ListRow)
                    {
                        decimal КількістьВПартії = (decimal)nameRow["Кількість"];
                        decimal СобівартістьПартії = (decimal)nameRow["Собівартість"];
                        ПартіяТоварівКомпозит_Pointer ПартіяТоварівКомпозит = new(nameRow["ПартіяТоварівКомпозит"]);
                        int Рядок = (int)nameRow["Рядок"];

                        decimal КількістьЩоСписується = 0;
                        bool ЗакритиПартію = КількістьЯкуПотрібноСписати >= КількістьВПартії;

                        if (КількістьВПартії >= КількістьЯкуПотрібноСписати)
                        {
                            КількістьЩоСписується = КількістьЯкуПотрібноСписати;
                            КількістьЯкуПотрібноСписати = 0;
                        }
                        else
                        {
                            КількістьЩоСписується = КількістьВПартії;
                            КількістьЯкуПотрібноСписати -= КількістьВПартії;
                        }

                        ПартіїТоварів_RecordsSet.Record record = new()
                        {
                            Income = false,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            Організація = ДокументОбєкт.Організація,
                            ПартіяТоварівКомпозит = ПартіяТоварівКомпозит,
                            Кількість = КількістьЩоСписується,
                            Собівартість = ЗакритиПартію ? СобівартістьПартії : 0,
                            СписанаСобівартість = СобівартістьПартії,
                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Серія = ТовариРядок.Серія,
                            Склад = ТовариРядок.Склад,
                            Рядок = Рядок,
                        };

                        партіїТоварів_RecordsSet.Records.Add(record);

                        ЗагальнаСумаСобівартість += СобівартістьПартії * КількістьЩоСписується;

                        if (КількістьЯкуПотрібноСписати == 0)
                            break;
                    }

                    if (КількістьЯкуПотрібноСписати > 0)
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Невистачило списати {КількістьЯкуПотрібноСписати} товарів");
                    }
                }
            }

            //ГотовийВиріб
            ПартіяТоварівКомпозит_Pointer ПартіяТоварівКомпозитНова = await ФункціїДляДокументів.ОтриматиПартіюТоварівКомпозит(
                ДокументОбєкт.UniqueID.UGuid,
                Перелічення.ТипДокументуПартіяТоварівКомпозит.ВиготовленняПродукції,
                null, null, ДокументОбєкт
            );

            foreach (ВиготовленняПродукції_ГотовийВиріб_TablePart.Record ТовариРядок in ДокументОбєкт.ГотовийВиріб_TablePart.Records)
            {
                if (СписокНоменклатуриГотовийВиріб[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ПартіїТоварів_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Організація = ДокументОбєкт.Організація,
                        ПартіяТоварівКомпозит = ПартіяТоварівКомпозитНова,
                        Кількість = ТовариРядок.Кількість * ТовариРядок.Коєфіціент,
                        Собівартість = Math.Round(ЗагальнаСумаСобівартість, 2),
                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Серія = ТовариРядок.Серія,
                        Склад = ТовариРядок.Склад,
                        Рядок = ТовариРядок.НомерРядка
                    };

                    партіїТоварів_RecordsSet.Records.Add(record);
                }
            }

            await партіїТоварів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Бух

            await ФункціїДляДокументів.ПровестиДокументБухгалтерськаОперація(ДокументОбєкт.ДокументБухгалтерськаОперація);

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static async Task Clear(ВиготовленняПродукції_Object ДокументОбєкт)
    {
        #region Бух

        await ФункціїДляДокументів.ВідмінитиПроведенняДокументуБухгалтерськаОперація(ДокументОбєкт.ДокументБухгалтерськаОперація);

        #endregion
    }
}
