
/*
    Модуль проведення документу
*/

using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class ВведенняЗалишків_SpendTheDocument
{
    public static async Task<bool> Spend(ВведенняЗалишків_Objest ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Objest> СписокНоменклатури = [];

            foreach (ВведенняЗалишків_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);
            }

            #endregion

            #region Товари на складах

            ТовариНаСкладах_RecordsSet товариНаСкладах_RecordsSet = new();
            foreach (ВведенняЗалишків_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ТовариНаСкладах_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Серія = ТовариРядок.Серія,
                        Склад = ДокументОбєкт.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок
                    };

                    товариНаСкладах_RecordsSet.Records.Add(record);
                }
            }
            await товариНаСкладах_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region ВільніЗалишки

            ВільніЗалишки_RecordsSet вільніЗалишки_RecordsSet = new();
            foreach (ВведенняЗалишків_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ВільніЗалишки_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Склад = ДокументОбєкт.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок
                    };

                    вільніЗалишки_RecordsSet.Records.Add(record);
                }
            }
            await вільніЗалишки_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Партії товарів

            ПартіяТоварівКомпозит_Pointer ПартіяТоварівКомпозит = await ФункціїДляДокументів.ОтриматиПартіюТоварівКомпозит(
                ДокументОбєкт.UniqueID.UGuid,
                Перелічення.ТипДокументуПартіяТоварівКомпозит.ВведенняЗалишків,
                null, ДокументОбєкт
            );

            ПартіїТоварів_RecordsSet партіїТоварів_RecordsSet = new();
            foreach (ВведенняЗалишків_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ПартіїТоварів_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Організація = ДокументОбєкт.Організація,
                        ПартіяТоварівКомпозит = ПартіяТоварівКомпозит,
                        Кількість = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок,
                        Собівартість = Math.Round(ТовариРядок.Ціна / ТовариРядок.КількістьУпаковок, 2),
                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Серія = ТовариРядок.Серія,
                        Склад = ДокументОбєкт.Склад,
                        Рядок = ТовариРядок.НомерРядка
                    };

                    партіїТоварів_RecordsSet.Records.Add(record);
                }
            }
            await партіїТоварів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РухКоштів

            РухКоштів_RecordsSet рухКоштів_RecordsSet = new();
            foreach (ВведенняЗалишків_Каси_TablePart.Record Каси_Record in ДокументОбєкт.Каси_TablePart.Records)
            {
                Валюти_Pointer валютаКаси = !Каси_Record.Каса.IsEmpty() ? (await Каси_Record.Каса.GetDirectoryObject())!.Валюта : ДокументОбєкт.Валюта;

                РухКоштів_RecordsSet.Record record_Каса = new()
                {
                    Income = true,
                    OwnerLineNum = Каси_Record.НомерРядка,

                    Організація = ДокументОбєкт.Організація,
                    Каса = Каси_Record.Каса,
                    Валюта = валютаКаси,
                    Сума = Каси_Record.Сума
                };

                рухКоштів_RecordsSet.Records.Add(record_Каса);
            }
            await рухКоштів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РозрахункиЗКлієнтами та РозрахункиЗПостачальниками

            РозрахункиЗКлієнтами_RecordsSet розрахункиЗКлієнтами_RecordsSet = new();
            РозрахункиЗПостачальниками_RecordsSet розрахункиЗПостачальниками_RecordsSet = new();
            foreach (ВведенняЗалишків_РозрахункиЗКонтрагентами_TablePart.Record РозрахункиЗКонтрагентами_Record in ДокументОбєкт.РозрахункиЗКонтрагентами_TablePart.Records)
            {
                if (РозрахункиЗКонтрагентами_Record.ТипКонтрагента == Перелічення.ТипиКонтрагентів.Клієнт)
                {
                    РозрахункиЗКлієнтами_RecordsSet.Record record_Клієнт = new()
                    {
                        Income = false,
                        OwnerLineNum = РозрахункиЗКонтрагентами_Record.НомерРядка,

                        Контрагент = РозрахункиЗКонтрагентами_Record.Контрагент,
                        Валюта = РозрахункиЗКонтрагентами_Record.Валюта,
                        Сума = РозрахункиЗКонтрагентами_Record.Сума
                    };

                    розрахункиЗКлієнтами_RecordsSet.Records.Add(record_Клієнт);
                }

                if (РозрахункиЗКонтрагентами_Record.ТипКонтрагента == Перелічення.ТипиКонтрагентів.Постачальник)
                {
                    РозрахункиЗПостачальниками_RecordsSet.Record record_Постачальник = new()
                    {
                        Income = true,
                        OwnerLineNum = РозрахункиЗКонтрагентами_Record.НомерРядка,

                        Контрагент = РозрахункиЗКонтрагентами_Record.Контрагент,
                        Валюта = РозрахункиЗКонтрагентами_Record.Валюта,
                        Сума = РозрахункиЗКонтрагентами_Record.Сума,
                    };

                    розрахункиЗПостачальниками_RecordsSet.Records.Add(record_Постачальник);
                }
            }
            await розрахункиЗКлієнтами_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());
            await розрахункиЗПостачальниками_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Бух

            if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            {
                var БухОперація = await ДокументОбєкт.ДокументБухгалтерськаОперація.GetDocumentObject(true);
                if (БухОперація != null)
                {
                    if (!await БухОперація.SpendTheDocument(БухОперація.ДатаДок))
                        throw new Exception($"Не вдалось провести бухгалтерський документ {БухОперація.Назва}");
                }
                else
                    throw new Exception($"Не вдалось прочитати бухгалтерський документ {ДокументОбєкт.ДокументБухгалтерськаОперація}");
            }

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static async Task Clear(ВведенняЗалишків_Objest ДокументОбєкт)
    {
        if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            await ДокументОбєкт.ДокументБухгалтерськаОперація.ClearSpendTheDocument();
    }
}