
/*
        Банки_Елемент.cs
        Елемент
*/

using Gtk;
using InterfaceGtk4;

using GeneratedCode.Довідники;
using GeneratedCode.Документи;
using GeneratedCode.Перелічення;

namespace StorageAndTrade;

class Банки_Елемент : DirectoryFormElement
{
    public Банки_Objest Елемент { get; init; } = new Банки_Objest();

    #region Fields
    Entry Код = new() { WidthRequest = 100 };
    Entry Назва = new() { WidthRequest = 500 };
    Entry ПовнаНазва = new() { WidthRequest = 500 };
    Entry НазваГоловноїУстановиАнг = new() { WidthRequest = 500 };
    Entry ТипНаселеногоПункту = new() { WidthRequest = 100 };
    Entry КодМФО = new() { WidthRequest = 100 };
    Entry КодЄДРПОУ = new() { WidthRequest = 100 };
    Entry УнікальнийКодБанку = new() { WidthRequest = 100 };
    Entry КодОбластіОпераційноїДіяльності = new() { WidthRequest = 100 };
    Entry НазваОбластіОпераційноїДіяльності = new() { WidthRequest = 100 };
    Entry КодОбластіЗгідноСтатуту = new() { WidthRequest = 100 };
    Entry НазваОбластіЗгідноСтатуту = new() { WidthRequest = 100 };
    Entry ПоштовийІндекс = new() { WidthRequest = 100 };
    Entry НазваНаселеногоПункту = new() { WidthRequest = 100 };
    Entry Адреса = new() { WidthRequest = 300 };
    Entry КодТелефонногоЗвязку = new() { WidthRequest = 100 };
    Entry НомерТелефону = new() { WidthRequest = 100 };
    Entry ЧисловийКодСтануУстанови = new() { WidthRequest = 100 };
    Entry НазваСтануУстанови = new() { WidthRequest = 300 };
    Entry ДатаЗміниСтану = new() { WidthRequest = 100 };
    Entry ДатаВідкриттяУстанови = new() { WidthRequest = 100 };
    Entry ДатаЗакриттяУстанови = new() { WidthRequest = 100 };
    Entry КодНБУ = new() { WidthRequest = 100 };
    Entry НомерЛіцензії = new() { WidthRequest = 100 };
    Entry ДатаЛіцензії = new() { WidthRequest = 100 };
    Entry КодСтатусу = new() { WidthRequest = 100 };
    Entry Статус = new() { WidthRequest = 300 };
    Entry ДатаЗапису = new() { WidthRequest = 100 };

    #endregion

    #region TabularParts

    #endregion

    public Банки_Елемент() : base(Program.BasicForm?.NotebookFunc)
    {
        Element = Елемент;

    }

    protected override void CreateStart(Box vBox)
    {

        // Код
        CreateField(vBox, "Код:", Код);

        // Назва
        CreateField(vBox, "Назва:", Назва);

        // ПовнаНазва
        CreateField(vBox, "Повна назва:", ПовнаНазва);

        // НазваГоловноїУстановиАнг
        CreateField(vBox, "Назва головної установи Анг:", НазваГоловноїУстановиАнг);

        // ТипНаселеногоПункту
        CreateField(vBox, "Тип населеного пункту:", ТипНаселеногоПункту);

        // КодМФО
        CreateField(vBox, "Код МФО:", КодМФО);

        // КодЄДРПОУ
        CreateField(vBox, "Код ЄДРПОУ:", КодЄДРПОУ);

        // УнікальнийКодБанку
        CreateField(vBox, "Унікальний код:", УнікальнийКодБанку);

        // КодОбластіОпераційноїДіяльності
        CreateField(vBox, "Код області операційної діяльності:", КодОбластіОпераційноїДіяльності);

        // НазваОбластіОпераційноїДіяльності
        CreateField(vBox, "Назва області операційної діяльності:", НазваОбластіОпераційноїДіяльності);

        // КодОбластіЗгідноСтатуту
        CreateField(vBox, "Код області згідно статуту:", КодОбластіЗгідноСтатуту);

        // НазваОбластіЗгідноСтатуту
        CreateField(vBox, "Назва області згідно статуту:", НазваОбластіЗгідноСтатуту);

        // ПоштовийІндекс
        CreateField(vBox, "Поштовий індекс:", ПоштовийІндекс);

        // НазваНаселеногоПункту
        CreateField(vBox, "Назва населеного пункту:", НазваНаселеногоПункту);

        // Адреса
        CreateField(vBox, "Адреса:", Адреса);

        // КодТелефонногоЗвязку
        CreateField(vBox, "Код телефонного зв'язку:", КодТелефонногоЗвязку);

        // НомерТелефону
        CreateField(vBox, "Номер телефону:", НомерТелефону);

        // ЧисловийКодСтануУстанови
        CreateField(vBox, "Числовий код стану установи:", ЧисловийКодСтануУстанови);

        // НазваСтануУстанови
        CreateField(vBox, "Назва стану установи:", НазваСтануУстанови);

        // ДатаЗміниСтану
        CreateField(vBox, "Дата зміни стану:", ДатаЗміниСтану);

        // ДатаВідкриттяУстанови
        CreateField(vBox, "Дата відкриття установи:", ДатаВідкриттяУстанови);

        // ДатаЗакриттяУстанови
        CreateField(vBox, "Дата закриття установи:", ДатаЗакриттяУстанови);

        // КодНБУ
        CreateField(vBox, "Код НБУ:", КодНБУ);

        // НомерЛіцензії
        CreateField(vBox, "Номер ліцензії:", НомерЛіцензії);

        // ДатаЛіцензії
        CreateField(vBox, "Дата ліцензії:", ДатаЛіцензії);

        // КодСтатусу
        CreateField(vBox, "Код статусу:", КодСтатусу);

        // Статус
        CreateField(vBox, "Статус:", Статус);

        // ДатаЗапису
        CreateField(vBox, "Дата запису:", ДатаЗапису);

    }

    protected override void CreateEnd(Box vBox)
    {

    }

    #region Присвоєння / зчитування значень

    public override async ValueTask AssignValue()
    {
        Код.SetText(Елемент.Код);
        Назва.SetText(Елемент.Назва);
        ПовнаНазва.SetText(Елемент.ПовнаНазва);
        НазваГоловноїУстановиАнг.SetText(Елемент.НазваГоловноїУстановиАнг);
        ТипНаселеногоПункту.SetText(Елемент.ТипНаселеногоПункту);
        КодМФО.SetText(Елемент.КодМФО);
        КодЄДРПОУ.SetText(Елемент.КодЄДРПОУ);
        УнікальнийКодБанку.SetText(Елемент.УнікальнийКодБанку);
        КодОбластіОпераційноїДіяльності.SetText(Елемент.КодОбластіОпераційноїДіяльності);
        НазваОбластіОпераційноїДіяльності.SetText(Елемент.НазваОбластіОпераційноїДіяльності);
        КодОбластіЗгідноСтатуту.SetText(Елемент.КодОбластіЗгідноСтатуту);
        НазваОбластіЗгідноСтатуту.SetText(Елемент.НазваОбластіЗгідноСтатуту);
        ПоштовийІндекс.SetText(Елемент.ПоштовийІндекс);
        НазваНаселеногоПункту.SetText(Елемент.НазваНаселеногоПункту);
        Адреса.SetText(Елемент.Адреса);
        КодТелефонногоЗвязку.SetText(Елемент.КодТелефонногоЗвязку);
        НомерТелефону.SetText(Елемент.НомерТелефону);
        ЧисловийКодСтануУстанови.SetText(Елемент.ЧисловийКодСтануУстанови);
        НазваСтануУстанови.SetText(Елемент.НазваСтануУстанови);
        ДатаЗміниСтану.SetText(Елемент.ДатаЗміниСтану);
        ДатаВідкриттяУстанови.SetText(Елемент.ДатаВідкриттяУстанови);
        ДатаЗакриттяУстанови.SetText(Елемент.ДатаЗакриттяУстанови);
        КодНБУ.SetText(Елемент.КодНБУ);
        НомерЛіцензії.SetText(Елемент.НомерЛіцензії);
        ДатаЛіцензії.SetText(Елемент.ДатаЛіцензії);
        КодСтатусу.SetText(Елемент.КодСтатусу);
        Статус.SetText(Елемент.Статус);
        ДатаЗапису.SetText(Елемент.ДатаЗапису);

    }

    protected override void GetValue()
    {
        Елемент.Код = Код.GetText();
        Елемент.Назва = Назва.GetText();
        Елемент.ПовнаНазва = ПовнаНазва.GetText();
        Елемент.НазваГоловноїУстановиАнг = НазваГоловноїУстановиАнг.GetText();
        Елемент.ТипНаселеногоПункту = ТипНаселеногоПункту.GetText();
        Елемент.КодМФО = КодМФО.GetText();
        Елемент.КодЄДРПОУ = КодЄДРПОУ.GetText();
        Елемент.УнікальнийКодБанку = УнікальнийКодБанку.GetText();
        Елемент.КодОбластіОпераційноїДіяльності = КодОбластіОпераційноїДіяльності.GetText();
        Елемент.НазваОбластіОпераційноїДіяльності = НазваОбластіОпераційноїДіяльності.GetText();
        Елемент.КодОбластіЗгідноСтатуту = КодОбластіЗгідноСтатуту.GetText();
        Елемент.НазваОбластіЗгідноСтатуту = НазваОбластіЗгідноСтатуту.GetText();
        Елемент.ПоштовийІндекс = ПоштовийІндекс.GetText();
        Елемент.НазваНаселеногоПункту = НазваНаселеногоПункту.GetText();
        Елемент.Адреса = Адреса.GetText();
        Елемент.КодТелефонногоЗвязку = КодТелефонногоЗвязку.GetText();
        Елемент.НомерТелефону = НомерТелефону.GetText();
        Елемент.ЧисловийКодСтануУстанови = ЧисловийКодСтануУстанови.GetText();
        Елемент.НазваСтануУстанови = НазваСтануУстанови.GetText();
        Елемент.ДатаЗміниСтану = ДатаЗміниСтану.GetText();
        Елемент.ДатаВідкриттяУстанови = ДатаВідкриттяУстанови.GetText();
        Елемент.ДатаЗакриттяУстанови = ДатаЗакриттяУстанови.GetText();
        Елемент.КодНБУ = КодНБУ.GetText();
        Елемент.НомерЛіцензії = НомерЛіцензії.GetText();
        Елемент.ДатаЛіцензії = ДатаЛіцензії.GetText();
        Елемент.КодСтатусу = КодСтатусу.GetText();
        Елемент.Статус = Статус.GetText();
        Елемент.ДатаЗапису = ДатаЗапису.GetText();

    }

    #endregion

    protected override async ValueTask<bool> Save()
    {
        bool isSaved = false;
        try
        {
            if (await Елемент.Save())
            {

                isSaved = true;
            }
        }
        catch
        {
            //ФункціїДляПовідомлень.ДодатиПовідомлення(Елемент.GetBasis(), Caption, ex);
        }
        return isSaved;
    }
}
