
/*
        Банки_Елемент.cs
        Елемент
*/

using Gtk;
using InterfaceGtk4;
using AccountingSoftware;

using GeneratedCode.Довідники;
using GeneratedCode.Документи;
using GeneratedCode.Перелічення;

namespace StorageAndTrade;

[GObject.Subclass<DirectoryFormElement>("Element_dXg5UC4Abk2zyf24w4jkOw")]
partial class Банки_Елемент : DirectoryFormElement
{
    public Банки_Objest Елемент { get; init; } = new();
    
    #region Fields
    Entry Код = Entry.New();
                    Entry Назва = Entry.New();
                    Entry ПовнаНазва = Entry.New();
                    Entry НазваГоловноїУстановиАнг = Entry.New();
                    Entry ТипНаселеногоПункту = Entry.New();
                    Entry КодМФО = Entry.New();
                    Entry КодЄДРПОУ = Entry.New();
                    Entry УнікальнийКодБанку = Entry.New();
                    Entry КодОбластіОпераційноїДіяльності = Entry.New();
                    Entry НазваОбластіОпераційноїДіяльності = Entry.New();
                    Entry КодОбластіЗгідноСтатуту = Entry.New();
                    Entry НазваОбластіЗгідноСтатуту = Entry.New();
                    Entry ПоштовийІндекс = Entry.New();
                    Entry НазваНаселеногоПункту = Entry.New();
                    Entry Адреса = Entry.New();
                    Entry КодТелефонногоЗвязку = Entry.New();
                    Entry НомерТелефону = Entry.New();
                    Entry ЧисловийКодСтануУстанови = Entry.New();
                    Entry НазваСтануУстанови = Entry.New();
                    Entry ДатаЗміниСтану = Entry.New();
                    Entry ДатаВідкриттяУстанови = Entry.New();
                    Entry ДатаЗакриттяУстанови = Entry.New();
                    Entry КодНБУ = Entry.New();
                    Entry НомерЛіцензії = Entry.New();
                    Entry ДатаЛіцензії = Entry.New();
                    Entry КодСтатусу = Entry.New();
                    Entry Статус = Entry.New();
                    Entry ДатаЗапису = Entry.New();
                    
    #endregion

    #region TabularParts
    
    #endregion

    partial void Initialize()
    { 
        Element = Елемент;

        
            // Код:
            Код.WidthRequest = 100;
                        
            // Назва:
            Назва.WidthRequest = 300;
                        
            // ПовнаНазва:
            ПовнаНазва.WidthRequest = 300;
                        
            // НазваГоловноїУстановиАнг:
            НазваГоловноїУстановиАнг.WidthRequest = 300;
                        
            // ТипНаселеногоПункту:
            ТипНаселеногоПункту.WidthRequest = 100;
                        
            // КодМФО:
            КодМФО.WidthRequest = 100;
                        
            // КодЄДРПОУ:
            КодЄДРПОУ.WidthRequest = 100;
                        
            // УнікальнийКодБанку:
            УнікальнийКодБанку.WidthRequest = 100;
                        
            // КодОбластіОпераційноїДіяльності:
            КодОбластіОпераційноїДіяльності.WidthRequest = 100;
                        
            // НазваОбластіОпераційноїДіяльності:
            НазваОбластіОпераційноїДіяльності.WidthRequest = 100;
                        
            // КодОбластіЗгідноСтатуту:
            КодОбластіЗгідноСтатуту.WidthRequest = 100;
                        
            // НазваОбластіЗгідноСтатуту:
            НазваОбластіЗгідноСтатуту.WidthRequest = 100;
                        
            // ПоштовийІндекс:
            ПоштовийІндекс.WidthRequest = 100;
                        
            // НазваНаселеногоПункту:
            НазваНаселеногоПункту.WidthRequest = 100;
                        
            // Адреса:
            Адреса.WidthRequest = 300;
                        
            // КодТелефонногоЗвязку:
            КодТелефонногоЗвязку.WidthRequest = 100;
                        
            // НомерТелефону:
            НомерТелефону.WidthRequest = 100;
                        
            // ЧисловийКодСтануУстанови:
            ЧисловийКодСтануУстанови.WidthRequest = 100;
                        
            // НазваСтануУстанови:
            НазваСтануУстанови.WidthRequest = 300;
                        
            // ДатаЗміниСтану:
            ДатаЗміниСтану.WidthRequest = 100;
                        
            // ДатаВідкриттяУстанови:
            ДатаВідкриттяУстанови.WidthRequest = 100;
                        
            // ДатаЗакриттяУстанови:
            ДатаЗакриттяУстанови.WidthRequest = 100;
                        
            // КодНБУ:
            КодНБУ.WidthRequest = 100;
                        
            // НомерЛіцензії:
            НомерЛіцензії.WidthRequest = 100;
                        
            // ДатаЛіцензії:
            ДатаЛіцензії.WidthRequest = 100;
                        
            // КодСтатусу:
            КодСтатусу.WidthRequest = 100;
                        
            // Статус:
            Статус.WidthRequest = 300;
                        
            // ДатаЗапису:
            ДатаЗапису.WidthRequest = 100;
                        
    }

    public static Банки_Елемент New()
    {
        Банки_Елемент element = NewWithProperties([]);
        element.NotebookFunc = Program.BasicForm?.NotebookFunc;

        return element;
    }

    protected override void CreateStart(Box vBox)
    {
        
            // Код
            CreateField(vBox, "Код:", Код);
                        
            // Назва
            CreateField(vBox, "Назва:", Назва);
                        
            // ПовнаНазва
            CreateField(vBox, "Повна назва:", ПовнаНазва);
                        
            // НазваГоловноїУстановиАнг
            CreateField(vBox, "Назва головної установи Анг:", НазваГоловноїУстановиАнг);
                        
            // ТипНаселеногоПункту
            CreateField(vBox, "Тип населеного пункту:", ТипНаселеногоПункту);
                        
            // КодМФО
            CreateField(vBox, "Код МФО:", КодМФО);
                        
            // КодЄДРПОУ
            CreateField(vBox, "Код ЄДРПОУ:", КодЄДРПОУ);
                        
            // УнікальнийКодБанку
            CreateField(vBox, "Унікальний код:", УнікальнийКодБанку);
                        
            // КодОбластіОпераційноїДіяльності
            CreateField(vBox, "Код області операційної діяльності:", КодОбластіОпераційноїДіяльності);
                        
            // НазваОбластіОпераційноїДіяльності
            CreateField(vBox, "Назва області операційної діяльності:", НазваОбластіОпераційноїДіяльності);
                        
            // КодОбластіЗгідноСтатуту
            CreateField(vBox, "Код області згідно статуту:", КодОбластіЗгідноСтатуту);
                        
            // НазваОбластіЗгідноСтатуту
            CreateField(vBox, "Назва області згідно статуту:", НазваОбластіЗгідноСтатуту);
                        
            // ПоштовийІндекс
            CreateField(vBox, "Поштовий індекс:", ПоштовийІндекс);
                        
            // НазваНаселеногоПункту
            CreateField(vBox, "Назва населеного пункту:", НазваНаселеногоПункту);
                        
            // Адреса
            CreateField(vBox, "Адреса:", Адреса);
                        
            // КодТелефонногоЗвязку
            CreateField(vBox, "Код телефонного зв'язку:", КодТелефонногоЗвязку);
                        
            // НомерТелефону
            CreateField(vBox, "Номер телефону:", НомерТелефону);
                        
            // ЧисловийКодСтануУстанови
            CreateField(vBox, "Числовий код стану установи:", ЧисловийКодСтануУстанови);
                        
            // НазваСтануУстанови
            CreateField(vBox, "Назва стану установи:", НазваСтануУстанови);
                        
            // ДатаЗміниСтану
            CreateField(vBox, "Дата зміни стану:", ДатаЗміниСтану);
                        
            // ДатаВідкриттяУстанови
            CreateField(vBox, "Дата відкриття установи:", ДатаВідкриттяУстанови);
                        
            // ДатаЗакриттяУстанови
            CreateField(vBox, "Дата закриття установи:", ДатаЗакриттяУстанови);
                        
            // КодНБУ
            CreateField(vBox, "Код НБУ:", КодНБУ);
                        
            // НомерЛіцензії
            CreateField(vBox, "Номер ліцензії:", НомерЛіцензії);
                        
            // ДатаЛіцензії
            CreateField(vBox, "Дата ліцензії:", ДатаЛіцензії);
                        
            // КодСтатусу
            CreateField(vBox, "Код статусу:", КодСтатусу);
                        
            // Статус
            CreateField(vBox, "Статус:", Статус);
                        
            // ДатаЗапису
            CreateField(vBox, "Дата запису:", ДатаЗапису);
                        
    }

    protected override void CreateEnd(Box vBox)
    {
        
    }

    #region Присвоєння / зчитування значень

    public override async ValueTask AssignValue()
    {
        Код.SetText(Елемент.Код);
                        Назва.SetText(Елемент.Назва);
                        ПовнаНазва.SetText(Елемент.ПовнаНазва);
                        НазваГоловноїУстановиАнг.SetText(Елемент.НазваГоловноїУстановиАнг);
                        ТипНаселеногоПункту.SetText(Елемент.ТипНаселеногоПункту);
                        КодМФО.SetText(Елемент.КодМФО);
                        КодЄДРПОУ.SetText(Елемент.КодЄДРПОУ);
                        УнікальнийКодБанку.SetText(Елемент.УнікальнийКодБанку);
                        КодОбластіОпераційноїДіяльності.SetText(Елемент.КодОбластіОпераційноїДіяльності);
                        НазваОбластіОпераційноїДіяльності.SetText(Елемент.НазваОбластіОпераційноїДіяльності);
                        КодОбластіЗгідноСтатуту.SetText(Елемент.КодОбластіЗгідноСтатуту);
                        НазваОбластіЗгідноСтатуту.SetText(Елемент.НазваОбластіЗгідноСтатуту);
                        ПоштовийІндекс.SetText(Елемент.ПоштовийІндекс);
                        НазваНаселеногоПункту.SetText(Елемент.НазваНаселеногоПункту);
                        Адреса.SetText(Елемент.Адреса);
                        КодТелефонногоЗвязку.SetText(Елемент.КодТелефонногоЗвязку);
                        НомерТелефону.SetText(Елемент.НомерТелефону);
                        ЧисловийКодСтануУстанови.SetText(Елемент.ЧисловийКодСтануУстанови);
                        НазваСтануУстанови.SetText(Елемент.НазваСтануУстанови);
                        ДатаЗміниСтану.SetText(Елемент.ДатаЗміниСтану);
                        ДатаВідкриттяУстанови.SetText(Елемент.ДатаВідкриттяУстанови);
                        ДатаЗакриттяУстанови.SetText(Елемент.ДатаЗакриттяУстанови);
                        КодНБУ.SetText(Елемент.КодНБУ);
                        НомерЛіцензії.SetText(Елемент.НомерЛіцензії);
                        ДатаЛіцензії.SetText(Елемент.ДатаЛіцензії);
                        КодСтатусу.SetText(Елемент.КодСтатусу);
                        Статус.SetText(Елемент.Статус);
                        ДатаЗапису.SetText(Елемент.ДатаЗапису);
                        
    }

    protected override void GetValue()
    {
        Елемент.Код = Код.GetText();
                        Елемент.Назва = Назва.GetText();
                        Елемент.ПовнаНазва = ПовнаНазва.GetText();
                        Елемент.НазваГоловноїУстановиАнг = НазваГоловноїУстановиАнг.GetText();
                        Елемент.ТипНаселеногоПункту = ТипНаселеногоПункту.GetText();
                        Елемент.КодМФО = КодМФО.GetText();
                        Елемент.КодЄДРПОУ = КодЄДРПОУ.GetText();
                        Елемент.УнікальнийКодБанку = УнікальнийКодБанку.GetText();
                        Елемент.КодОбластіОпераційноїДіяльності = КодОбластіОпераційноїДіяльності.GetText();
                        Елемент.НазваОбластіОпераційноїДіяльності = НазваОбластіОпераційноїДіяльності.GetText();
                        Елемент.КодОбластіЗгідноСтатуту = КодОбластіЗгідноСтатуту.GetText();
                        Елемент.НазваОбластіЗгідноСтатуту = НазваОбластіЗгідноСтатуту.GetText();
                        Елемент.ПоштовийІндекс = ПоштовийІндекс.GetText();
                        Елемент.НазваНаселеногоПункту = НазваНаселеногоПункту.GetText();
                        Елемент.Адреса = Адреса.GetText();
                        Елемент.КодТелефонногоЗвязку = КодТелефонногоЗвязку.GetText();
                        Елемент.НомерТелефону = НомерТелефону.GetText();
                        Елемент.ЧисловийКодСтануУстанови = ЧисловийКодСтануУстанови.GetText();
                        Елемент.НазваСтануУстанови = НазваСтануУстанови.GetText();
                        Елемент.ДатаЗміниСтану = ДатаЗміниСтану.GetText();
                        Елемент.ДатаВідкриттяУстанови = ДатаВідкриттяУстанови.GetText();
                        Елемент.ДатаЗакриттяУстанови = ДатаЗакриттяУстанови.GetText();
                        Елемент.КодНБУ = КодНБУ.GetText();
                        Елемент.НомерЛіцензії = НомерЛіцензії.GetText();
                        Елемент.ДатаЛіцензії = ДатаЛіцензії.GetText();
                        Елемент.КодСтатусу = КодСтатусу.GetText();
                        Елемент.Статус = Статус.GetText();
                        Елемент.ДатаЗапису = ДатаЗапису.GetText();
                        
    }

    #endregion

    protected override async ValueTask<bool> Save()
    {
        bool isSaved = false;
        try
        {
            if (await Елемент.Save())
            {
                
                isSaved = true;
            }
        }
        catch (Exception ex)
        {
            ФункціїДляПовідомлень.ДодатиПовідомлення(Елемент.GetBasis(), Caption, ex);
        }
        return isSaved;
    }
}
    