

/*
    Модуль проведення документу
*/

using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class РеалізаціяТоварівТаПослуг_SpendTheDocument
{
    public async static Task<bool> Spend(РеалізаціяТоварівТаПослуг_Object ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Object> СписокНоменклатури = [];
            Dictionary<int, decimal> ЗалишокНоменклатури = [];
            Dictionary<int, decimal> РезервНоменклатури = [];
            Dictionary<int, decimal> РезервРахунку = [];
            Dictionary<int, decimal> РезервЗамовлення = [];

            Dictionary<int, decimal> ЗамволенняКлієнта = [];
            Dictionary<int, decimal> ЗамволенняКлієнтаСума = [];

            foreach (РеалізаціяТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);

                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    //
                    //Для товарів отримуємо залишки
                    //

                    var recordResult = await ПроведенняДокументів.ОтриматиЗалишкиТоваруНаСкладі(
                        ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури, ТовариРядок.Серія,
                        !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                        ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                    ЗалишокНоменклатури.Add(ТовариРядок.НомерРядка, recordResult.Result ? (decimal)recordResult.ListRow[0]["ВНаявності"] : 0);

                    if (ЗалишокНоменклатури[ТовариРядок.НомерРядка] > 0)
                    {
                        if (ЗалишокНоменклатури[ТовариРядок.НомерРядка] < ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок)
                        {
                            throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                $"Залишок товару {ЗалишокНоменклатури[ТовариРядок.НомерРядка]}, потрібно {ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок}");
                        }

                        //
                        // Рахуємо всі резерви
                        //

                        recordResult = await ПроведенняДокументів.ОтриматиРезервТоваруНаСкладі(
                            ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                            !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                            ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                        РезервНоменклатури.Add(ТовариРядок.НомерРядка, recordResult.Result ? (decimal)recordResult.ListRow[0]["ВРезервіЗіСкладу"] : 0);

                        //
                        // Перевірка резервів по документах
                        //

                        if (!ТовариРядок.ЗамовленняКлієнта.IsEmpty())
                        {
                            //
                            // Якщо заданий документ Замовлення Клієнта
                            // потрібно дізнатися скільки цей документ зарезервував товарів
                            //

                            recordResult = await ПроведенняДокументів.ОтриматиРезервТоваруПоДокументу(
                                ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                                !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                                ТовариРядок.ЗамовленняКлієнта.UniqueID, ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                            if (recordResult.Result)
                                РезервЗамовлення.Add(ТовариРядок.НомерРядка, (decimal)recordResult.ListRow[0]["ВРезервіЗіСкладу"]);

                            //
                            // Перевірити замовлення
                            //

                            recordResult = await ПроведенняДокументів.ОтриматиЗамовленняКлієнтаДляТоваруПоДокументу(
                                ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                                !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                                ТовариРядок.ЗамовленняКлієнта.UniqueID, ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                            if (recordResult.Result)
                            {
                                ЗамволенняКлієнта.Add(ТовариРядок.НомерРядка, (decimal)recordResult.ListRow[0]["Замовлено"]);
                                ЗамволенняКлієнтаСума.Add(ТовариРядок.НомерРядка, (decimal)recordResult.ListRow[0]["Сума"]);

                                if (!(ЗамволенняКлієнта[ТовариРядок.НомерРядка] > 0))
                                {
                                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                        $"Залишок по документу Замовлення {ЗамволенняКлієнта[ТовариРядок.НомерРядка]}");
                                }
                            }
                            else
                            {
                                throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                    $"Відсутнє замовлення для товару {СписокНоменклатури[ТовариРядок.НомерРядка].Назва} в документі Замовлення клієнта");
                            }
                        }

                        if (!ТовариРядок.РахунокФактура.IsEmpty())
                        {
                            //
                            // Якщо заданий документ Рахунок фактура
                            // потрібно дізнатися скільки цей документ зарезервував товарів
                            //

                            recordResult = await ПроведенняДокументів.ОтриматиРезервТоваруПоДокументу(
                                ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                                !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                                ТовариРядок.РахунокФактура.UniqueID, ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок);

                            if (recordResult.Result)
                                РезервРахунку.Add(ТовариРядок.НомерРядка, (decimal)recordResult.ListRow[0]["ВРезервіЗіСкладу"]);
                            else
                            {
                                throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                    $"Вказаний рахунок фактура, не зарезервував товар {СписокНоменклатури[ТовариРядок.НомерРядка].Назва}");
                            }
                        }

                        if (РезервНоменклатури[ТовариРядок.НомерРядка] > 0)
                        {
                            decimal ВРезервіЗамовленняКлієнта = РезервЗамовлення.ContainsKey(ТовариРядок.НомерРядка) ? РезервЗамовлення[ТовариРядок.НомерРядка] : 0;
                            decimal ВРезервіРахунокФактура = РезервРахунку.ContainsKey(ТовариРядок.НомерРядка) ? РезервРахунку[ТовариРядок.НомерРядка] : 0;
                            decimal РезервДокументівСума = ВРезервіРахунокФактура + ВРезервіЗамовленняКлієнта;
                            decimal РезервЗагальний = РезервНоменклатури[ТовариРядок.НомерРядка] - РезервДокументівСума;

                            if (ЗалишокНоменклатури[ТовариРядок.НомерРядка] - РезервЗагальний < ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок)
                            {
                                if (РезервДокументівСума == 0)
                                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                        $"Залишок товару {ЗалишокНоменклатури[ТовариРядок.НомерРядка]}, " +
                                        $"в резерві {РезервЗагальний}, " +
                                        $"потрібно {ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок}");
                                else
                                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                                        $"Залишок товару {ЗалишокНоменклатури[ТовариРядок.НомерРядка]}, " +
                                        $"в резерві по вибраних документах (замовлення або рахунок) {РезервДокументівСума}, " +
                                        $"потрібно {ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок}");
                            }
                        }
                    }
                    else
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Відсутній товар {СписокНоменклатури[ТовариРядок.НомерРядка].Назва}");
                    }
                }
            }

            #endregion

            #region ЗамовленняКлієнтів

            ЗамовленняКлієнтів_RecordsSet замовленняКлієнтів_RecordsSet = new();

            foreach (РеалізаціяТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    if (!ТовариРядок.ЗамовленняКлієнта.IsEmpty())
                    {
                        decimal Замовлено = ЗамволенняКлієнта.ContainsKey(ТовариРядок.НомерРядка) ? ЗамволенняКлієнта[ТовариРядок.НомерРядка] : 0;
                        decimal ЗамовленняСума = ЗамволенняКлієнтаСума.ContainsKey(ТовариРядок.НомерРядка) ? ЗамволенняКлієнтаСума[ТовариРядок.НомерРядка] : 0;

                        ЗамовленняКлієнтів_RecordsSet.Record record = new()
                        {
                            Income = false,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            ЗамовленняКлієнта = ТовариРядок.ЗамовленняКлієнта,
                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                            Замовлено = Замовлено > ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок ? ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок : Замовлено,
                            Сума = Замовлено > ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок ? 0 : ЗамовленняСума
                        };

                        замовленняКлієнтів_RecordsSet.Records.Add(record);
                    }
                }
            }

            await замовленняКлієнтів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region ВільніЗалишки

            ВільніЗалишки_RecordsSet вільніЗалишки_RecordsSet = new();

            foreach (РеалізаціяТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    decimal КількістьЯкуПотрібноРозприділити = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок;

                    //
                    // Якщо є документи замовлення або рахунок
                    // кількість потрібно розприділии між документами.
                    // В першу чергу списується ЗамовленняКлієнта, потім Рахунок фактура
                    //

                    if (ТовариРядок.ЗамовленняКлієнта.IsEmpty() || ТовариРядок.РахунокФактура.IsEmpty())
                    {
                        decimal ВРезервіЗамовленняКлієнта = РезервЗамовлення.ContainsKey(ТовариРядок.НомерРядка) ? РезервЗамовлення[ТовариРядок.НомерРядка] : 0;
                        decimal ВРезервіРахунокФактура = РезервРахунку.ContainsKey(ТовариРядок.НомерРядка) ? РезервРахунку[ТовариРядок.НомерРядка] : 0;

                        if (!ТовариРядок.ЗамовленняКлієнта.IsEmpty() && ВРезервіЗамовленняКлієнта > 0)
                        {
                            decimal вНаявності = КількістьЯкуПотрібноРозприділити >= ВРезервіЗамовленняКлієнта ?
                                ВРезервіЗамовленняКлієнта : КількістьЯкуПотрібноРозприділити;

                            ВільніЗалишки_RecordsSet.Record record = new()
                            {
                                Income = false,
                                OwnerLineNum = ТовариРядок.НомерРядка,

                                Номенклатура = ТовариРядок.Номенклатура,
                                ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                                Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                                ВНаявності = вНаявності,
                                ВРезервіЗіСкладу = вНаявності,
                                ДокументРезерву = ТовариРядок.ЗамовленняКлієнта.UniqueID.UGuid
                            };

                            вільніЗалишки_RecordsSet.Records.Add(record);

                            КількістьЯкуПотрібноРозприділити -= вНаявності;
                        }

                        if (!ТовариРядок.РахунокФактура.IsEmpty() && КількістьЯкуПотрібноРозприділити > 0 && ВРезервіРахунокФактура > 0)
                        {
                            decimal вНаявності = КількістьЯкуПотрібноРозприділити >= ВРезервіРахунокФактура ?
                              ВРезервіРахунокФактура : КількістьЯкуПотрібноРозприділити;

                            ВільніЗалишки_RecordsSet.Record record = new()
                            {
                                Income = false,
                                OwnerLineNum = ТовариРядок.НомерРядка,

                                Номенклатура = ТовариРядок.Номенклатура,
                                ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                                Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                                ВНаявності = вНаявності,
                                ВРезервіЗіСкладу = вНаявності,
                                ДокументРезерву = ТовариРядок.РахунокФактура.UniqueID.UGuid
                            };

                            вільніЗалишки_RecordsSet.Records.Add(record);

                            КількістьЯкуПотрібноРозприділити -= record.ВНаявності;
                        }
                    }

                    if (КількістьЯкуПотрібноРозприділити > 0)
                    {
                        ВільніЗалишки_RecordsSet.Record record = new()
                        {
                            Income = false,
                            OwnerLineNum = ТовариРядок.НомерРядка,

                            Номенклатура = ТовариРядок.Номенклатура,
                            ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                            Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                            ВНаявності = КількістьЯкуПотрібноРозприділити
                        };

                        вільніЗалишки_RecordsSet.Records.Add(record);
                    }
                }
            }

            await вільніЗалишки_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Товари на складах

            ТовариНаСкладах_RecordsSet товариНаСкладах_RecordsSet = new();

            foreach (РеалізаціяТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    ТовариНаСкладах_RecordsSet.Record record = new()
                    {
                        Income = false,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Серія = ТовариРядок.Серія,
                        Склад = !ТовариРядок.Склад.IsEmpty() ? ТовариРядок.Склад : ДокументОбєкт.Склад,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок
                    };

                    товариНаСкладах_RecordsSet.Records.Add(record);
                }
            }

            await товариНаСкладах_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Партії товарів & Продажі

            ПартіїТоварів_RecordsSet партіїТоварів_RecordsSet = new();
            Продажі_RecordsSet продажі_RecordsSet = new();

            foreach (РеалізаціяТоварівТаПослуг_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                //Товари
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    var recordResult = await ПроведенняДокументів.ОтриматиСписокНаявнихПартій(
                        ДокументОбєкт.Організація, ТовариРядок.Номенклатура, ТовариРядок.ХарактеристикаНоменклатури,
                        ТовариРядок.Серія, ДокументОбєкт.Склад, ТовариРядок.Партія, ДокументОбєкт.UniqueID, ДокументОбєкт.ДатаДок,
                        ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок);

                    if (!recordResult.Result)
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Немає доступних партій для товару {СписокНоменклатури[ТовариРядок.НомерРядка].Назва}");
                    }

                    decimal КількістьЯкуПотрібноСписати = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок;

                    foreach (Dictionary<string, object> nameRow in recordResult.ListRow)
                    {
                        decimal КількістьВПартії = (decimal)nameRow["Кількість"];
                        decimal СобівартістьПартії = (decimal)nameRow["Собівартість"];
                        ПартіяТоварівКомпозит_Pointer ПартіяТоварівКомпозит = new(nameRow["ПартіяТоварівКомпозит"]);
                        int Рядок = (int)nameRow["Рядок"];

                        decimal КількістьЩоСписується = 0;
                        bool ЗакритиПартію = КількістьЯкуПотрібноСписати >= КількістьВПартії;

                        if (КількістьВПартії >= КількістьЯкуПотрібноСписати)
                        {
                            КількістьЩоСписується = КількістьЯкуПотрібноСписати;
                            КількістьЯкуПотрібноСписати = 0;
                        }
                        else
                        {
                            КількістьЩоСписується = КількістьВПартії;
                            КількістьЯкуПотрібноСписати -= КількістьВПартії;
                        }

                        //ПартіїТоварів
                        {
                            ПартіїТоварів_RecordsSet.Record record = new()
                            {
                                Income = false,
                                OwnerLineNum = ТовариРядок.НомерРядка,

                                Організація = ДокументОбєкт.Організація,
                                ПартіяТоварівКомпозит = ПартіяТоварівКомпозит,
                                Кількість = КількістьЩоСписується,
                                Собівартість = ЗакритиПартію ? СобівартістьПартії : 0,
                                СписанаСобівартість = СобівартістьПартії,
                                Номенклатура = ТовариРядок.Номенклатура,
                                ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                                Серія = ТовариРядок.Серія,
                                Склад = ДокументОбєкт.Склад,
                                Рядок = Рядок
                            };

                            партіїТоварів_RecordsSet.Records.Add(record);
                        }

                        //Продажі
                        {
                            Продажі_RecordsSet.Record record = new()
                            {
                                OwnerLineNum = ТовариРядок.НомерРядка,

                                Організація = ДокументОбєкт.Організація,
                                Склад = ДокументОбєкт.Склад,
                                Контрагент = ДокументОбєкт.Контрагент,
                                Договір = ДокументОбєкт.Договір,
                                Номенклатура = ТовариРядок.Номенклатура,
                                ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                                Кількість = КількістьЩоСписується,
                                Сума = (ТовариРядок.Ціна / ТовариРядок.КількістьУпаковок) * КількістьЩоСписується,
                                Собівартість = СобівартістьПартії
                            };

                            record.Дохід = record.Сума - (СобівартістьПартії * КількістьЩоСписується);

                            продажі_RecordsSet.Records.Add(record);
                        }

                        if (КількістьЯкуПотрібноСписати == 0)
                            break;
                    }

                    if (КількістьЯкуПотрібноСписати > 0)
                    {
                        throw new Exception($"Рядок {ТовариРядок.НомерРядка}. " +
                            $"Невистачило списати {КількістьЯкуПотрібноСписати} товарів");
                    }
                }

                //Послуги
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Послуга)
                {
                    Продажі_RecordsSet.Record record = new()
                    {
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Організація = ДокументОбєкт.Організація,
                        Склад = ДокументОбєкт.Склад,
                        Контрагент = ДокументОбєкт.Контрагент,
                        Договір = ДокументОбєкт.Договір,
                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Кількість = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок,
                        Сума = ТовариРядок.Сума,
                        Дохід = ТовариРядок.Сума
                    };

                    продажі_RecordsSet.Records.Add(record);
                }
            }

            await партіїТоварів_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());
            await продажі_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region РозрахункиЗКлієнтами

            //
            //РозрахункиЗКлієнтами
            //

            РозрахункиЗКлієнтами_RecordsSet розрахункиЗКлієнтами_RecordsSet = new();

            РозрахункиЗКлієнтами_RecordsSet.Record розрахункиЗКлієнтами_Record = new()
            {
                Income = true,

                Контрагент = ДокументОбєкт.Контрагент,
                Валюта = ДокументОбєкт.Валюта,
                Сума = ДокументОбєкт.СумаДокументу
            };

            розрахункиЗКлієнтами_RecordsSet.Records.Add(розрахункиЗКлієнтами_Record);

            await розрахункиЗКлієнтами_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            #region Бух

            if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            {
                var БухОперація = await ДокументОбєкт.ДокументБухгалтерськаОперація.GetDocumentObject(true);
                if (БухОперація != null)
                {
                    if (!await БухОперація.SpendTheDocument(БухОперація.ДатаДок))
                        throw new Exception($"Не вдалось провести бухгалтерський документ {БухОперація.Назва}");
                }
                else
                    throw new Exception($"Не вдалось прочитати бухгалтерський документ {ДокументОбєкт.ДокументБухгалтерськаОперація}");
            }

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static async Task Clear(РеалізаціяТоварівТаПослуг_Object ДокументОбєкт)
    {
        if (!ДокументОбєкт.ДокументБухгалтерськаОперація.IsEmpty())
            await ДокументОбєкт.ДокументБухгалтерськаОперація.ClearSpendTheDocument();
    }
}