

/*
    Модуль проведення документу
*/

using StorageAndTrade;
using GeneratedCode.Довідники;
using GeneratedCode.РегістриНакопичення;

namespace GeneratedCode.Документи;

class РозміщенняТоварівНаСкладі_SpendTheDocument
{
    public static async Task<bool> Spend(РозміщенняТоварівНаСкладі_Object ДокументОбєкт)
    {
        try
        {
            #region Підготовка

            Dictionary<int, Номенклатура_Object> СписокНоменклатури = [];

            foreach (РозміщенняТоварівНаСкладі_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (ТовариРядок.Номенклатура.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Номенклатура");

                if (!(ТовариРядок.КількістьУпаковок > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Коєфіціент має бути 1 або більше");

                if (ТовариРядок.Комірка.IsEmpty())
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Не заповнене поле Комірка");

                if (!(ТовариРядок.Кількість > 0))
                    throw new Exception($"Рядок {ТовариРядок.НомерРядка}. Кількість має бути більшою 0");

                СписокНоменклатури.Add(ТовариРядок.НомерРядка, (await ТовариРядок.Номенклатура.GetDirectoryObject())!);
            }

            #endregion

            #region ТовариВКомірках

            ТовариВКомірках_RecordsSet товариВКомірках_RecordsSet = new();

            foreach (РозміщенняТоварівНаСкладі_Товари_TablePart.Record ТовариРядок in ДокументОбєкт.Товари_TablePart.Records)
            {
                if (СписокНоменклатури[ТовариРядок.НомерРядка].ТипНоменклатури == Перелічення.ТипиНоменклатури.Товар)
                {
                    //Одиниця виміру береться з номенклатури
                    ПакуванняОдиниціВиміру_Pointer ОдиницяВиміруНоменклатури = СписокНоменклатури[ТовариРядок.НомерРядка].ОдиницяВиміру;

                    ТовариВКомірках_RecordsSet.Record record = new()
                    {
                        Income = true,
                        OwnerLineNum = ТовариРядок.НомерРядка,

                        Номенклатура = ТовариРядок.Номенклатура,
                        ХарактеристикаНоменклатури = ТовариРядок.ХарактеристикаНоменклатури,
                        Пакування = ОдиницяВиміруНоменклатури,
                        Комірка = ТовариРядок.Комірка,
                        Серія = ТовариРядок.Серія,
                        ВНаявності = ТовариРядок.Кількість * ТовариРядок.КількістьУпаковок,
                    };

                    товариВКомірках_RecordsSet.Records.Add(record);
                }
            }

            await товариВКомірках_RecordsSet.Save(ДокументОбєкт.ДатаДок, ДокументОбєкт.GetBasis());

            #endregion

            return true;
        }
        catch (Exception ex)
        {
            await ПроведенняДокументів.ДокументНеПроводиться(ДокументОбєкт, ДокументОбєкт.Назва, ex.Message);
            return false;
        }
    }

    public static Task ClearSpend(РозміщенняТоварівНаСкладі_Object ДокументОбєкт)
    {
        return Task.CompletedTask;
    }
}